-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Sep 11, 2018 at 01:06 PM
-- Server version: 5.6.22-72.0-log
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `krishwt5_chapa`
--

-- --------------------------------------------------------

--
-- Table structure for table `district`
--

CREATE TABLE `district` (
  `id` int(10) NOT NULL,
  `name` varchar(250) NOT NULL,
  `code` varchar(20) NOT NULL,
  `ecozone` varchar(500) NOT NULL,
  `devregion` varchar(500) NOT NULL,
  `publish` varchar(3) NOT NULL,
  `weight` int(10) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `district`
--

INSERT INTO `district` (`id`, `name`, `code`, `ecozone`, `devregion`, `publish`, `weight`) VALUES
(2, 'झापा', '001', 'तराइ', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 10),
(3, 'इलाम', '002', 'तराइ', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 20),
(4, 'पाँचथर', '003', 'पहाड', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 30),
(5, 'ताप्लेजुङ', '004', 'हिमाल', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 40),
(6, 'मोरङ ', '005', 'तराइ', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 50),
(7, 'सुनसरी', '006', 'तराइ', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 60),
(8, 'भोजपुर', '007', 'पहाड', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 70),
(9, 'धनकुटा', '008', 'पहाड', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 80),
(10, 'तेह्रथुम ', '009', 'पहाड', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 90),
(11, 'संखुवासभा', '010', 'हिमाल', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 100),
(12, 'सिराहा', '011', 'तराइ', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 110),
(13, 'उदयपुर', '012', 'पहाड', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 120),
(14, 'खोटाङ', '013', 'पहाड', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 130),
(15, 'ओखलढुङ्गा', '014', 'पहाड', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 140),
(16, 'सोलुखुम्बु', '015', 'हिमाल', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 150),
(17, 'धनुषा', '017', 'तराइ', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 170),
(28, 'सप्तरी', '016', 'तराइ', 'पूर्वाञ्चल विकास क्षेत्र', 'Yes', 160),
(19, 'महोत्तरी', '018', 'तराइ', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 180),
(20, 'सिन्धुली', '019', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 190),
(30, 'काभ्रेपलाञ्चोक', '020', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 200),
(22, 'रामेछाप', '021', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 210),
(23, 'दोलखा', '022', 'हिमाल', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 220),
(24, 'भक्तपुर', '023', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 230),
(25, 'धादिङ', '024', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 240),
(27, 'काठमाडौं ', '025', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 250),
(29, 'सर्लाही', '026', 'तराइ', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 260),
(31, 'ललितपुर', '027', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 270),
(32, 'नुवाकोट', '028', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 280),
(33, 'मकवानपुर', '029', 'पहाड', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 290),
(34, 'रसुवा', '030', 'हिमाल', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 300),
(35, 'सिन्धुपलाञ्चोक', '031', 'हिमाल', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 310),
(36, 'बारा', '032', 'तराइ', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 320),
(37, 'पर्सा', '033', 'तराइ', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 330),
(38, 'रौतहट', '034', 'तराइ', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 340),
(39, 'चितवन', '035', 'तराइ', 'मध्यमाञ्चल विकास क्षेत्र', 'Yes', 350),
(40, 'गोर्खा', '036', 'तराइ', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 360),
(41, 'कास्की', '037', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 370),
(42, 'लमजुङ् ', '038', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 380),
(43, 'स्याङ्जा', '039', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 390),
(44, 'तनहुँ ', '040', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 400),
(45, 'मनाङ', '041', 'हिमाल', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 410),
(46, 'कपिलवस्तु', '042', 'तराइ', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 420),
(47, 'नवलपरासी ', '043', 'तराइ', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 430),
(48, 'रूपन्देही', '044', 'तराइ', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 440),
(49, 'अर्घाखाँची ', '0045', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 450),
(50, 'गुल्मी ', '046', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 460),
(51, 'पाल्पा ', '047', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 470),
(52, 'बाग्लुङ ', '048', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 480),
(53, 'म्याग्दी ', '049', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 490),
(54, 'पर्वत ', '050', 'पहाड', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 500),
(55, 'मुस्ताङ ', '051', 'हिमाल', 'पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 510),
(56, 'दाङ', '052', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 520),
(57, 'प्युठान', '053', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 530),
(58, 'रोल्पा', '054', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 540),
(59, 'रुकुम ', '055', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 550),
(60, 'सल्यान', '056', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 560),
(61, 'बाँके ', '057', 'तराइ', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 570),
(62, 'बर्दिया ', '058', 'तराइ', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 580),
(63, 'सुर्खेत ', '059', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 590),
(64, 'दैलेख ', '060', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 600),
(65, 'जाजरकोट ', '061', 'पहाड', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 610),
(66, 'डोल्पा ', '062', 'हिमाल', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 620),
(67, 'हुम्ला ', '063', 'हिमाल', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 630),
(68, 'जुम्ला ', '064', 'हिमाल', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 640),
(69, 'कालीकोट ', '065', 'हिमाल', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 650),
(70, 'मुगु ', '066', 'हिमाल', 'मध्य-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 660),
(71, 'कैलाली ', '067', 'तराइ', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 670),
(72, 'अछाम ', '068', 'पहाड', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 680),
(73, 'डोटी ', '0069', 'पहाड', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 690),
(74, 'बझाङ ', '070', 'हिमाल', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 700),
(75, 'बाजुरा', '071', 'हिमाल', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 710),
(76, 'कञ्चनपुर ', '072', 'तराइ', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 720),
(77, 'डडेलधुरा ', '073', 'पहाड', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 730),
(78, 'वैतडी', '074', 'पहाड', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 740),
(79, 'दार्चुला ', '075', 'पहाड', 'सुदूर-पश्चिमाञ्चल विकास क्षेत्र', 'Yes', 750);

-- --------------------------------------------------------

--
-- Table structure for table `family`
--

CREATE TABLE `family` (
  `id` int(30) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `birthDate` date NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(255) CHARACTER SET utf8 NOT NULL,
  `maritalStatus` varchar(255) CHARACTER SET utf8 NOT NULL,
  `gotraId` int(11) NOT NULL,
  `regionId` int(11) NOT NULL,
  `gender` varchar(255) CHARACTER SET utf8 NOT NULL,
  `image` varchar(255) NOT NULL,
  `publish` varchar(3) NOT NULL,
  `onDate` date NOT NULL,
  `weight` int(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `family`
--

INSERT INTO `family` (`id`, `name`, `birthDate`, `email`, `phone`, `maritalStatus`, `gotraId`, `regionId`, `gender`, `image`, `publish`, `onDate`, `weight`) VALUES
(8, 'Hari Daas', '2018-01-11', 'haridas@gmail.com', '98769867', 'Married', 9, 6, 'Male', '', 'Yes', '2018-01-02', 20),
(9, 'First mother', '2018-01-30', 'firstmother@gmail.com', '8977878', 'Married', 9, 7, 'Female', '', 'Yes', '2018-01-02', 30),
(13, 'first child male', '2018-01-03', 'gfgf', '456456', 'Married', 9, 6, 'Male', '', 'Yes', '2018-01-02', 40),
(14, 'first child female', '2018-01-13', 'fsdfk@gmail.com', '5464565', 'Married', 9, 7, 'Female', '', 'Yes', '2018-01-02', 50),
(15, 'ramesh Chaudhary', '0000-00-00', 'ramesh@gmail.com', '456456676', 'Married', 9, 6, 'Male', '', 'Yes', '2018-01-02', 60),
(16, 'zdf', '0000-00-00', '', '', 'Married', 9, 6, 'Male', '', 'No', '2018-07-02', 70),
(17, 'sdf', '0000-00-00', '', '', 'Married', 9, 6, 'Male', '', 'No', '2018-07-02', 80),
(18, 'sdfsd', '0000-00-00', '', '', 'Married', 9, 6, 'Male', '', 'No', '2018-07-02', 90),
(19, 'sdfds', '0000-00-00', '', '', 'Married', 9, 6, 'Male', '', 'No', '2018-07-02', 100);

-- --------------------------------------------------------

--
-- Table structure for table `feedbacks`
--

CREATE TABLE `feedbacks` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `address` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `phone` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `subject` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `comment` text CHARACTER SET utf8,
  `onDate` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `feedbacks`
--

INSERT INTO `feedbacks` (`id`, `name`, `address`, `phone`, `email`, `subject`, `comment`, `onDate`) VALUES
(11, 'Ganesh', 'Ktm', '8988', 'kh6ganesh@gmail.com', 'test sub', 'test comment', '2018-01-04 18:51:06');

-- --------------------------------------------------------

--
-- Table structure for table `gotra`
--

CREATE TABLE `gotra` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `onDate` date NOT NULL,
  `publish` varchar(3) NOT NULL,
  `weight` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `gotra`
--

INSERT INTO `gotra` (`id`, `name`, `onDate`, `publish`, `weight`) VALUES
(9, 'First gotra', '2017-12-26', 'Yes', 10),
(13, 'Second Gotra', '2018-01-02', 'Yes', 20);

-- --------------------------------------------------------

--
-- Table structure for table `groups`
--

CREATE TABLE `groups` (
  `id` int(11) NOT NULL,
  `name` varchar(250) NOT NULL DEFAULT '',
  `nameen` varchar(255) NOT NULL,
  `urlname` varchar(250) CHARACTER SET latin1 NOT NULL,
  `type` varchar(200) CHARACTER SET latin1 NOT NULL DEFAULT '',
  `parentId` int(11) NOT NULL DEFAULT '0',
  `shortcontents` text NOT NULL,
  `shortcontentsen` text NOT NULL,
  `contents` longtext NOT NULL,
  `contentsen` text NOT NULL,
  `linkType` varchar(255) CHARACTER SET latin1 NOT NULL DEFAULT '',
  `weight` int(11) NOT NULL DEFAULT '50',
  `hide` varchar(3) CHARACTER SET latin1 NOT NULL DEFAULT 'no',
  `onDate` date NOT NULL DEFAULT '0000-00-00',
  `image` varchar(250) CHARACTER SET latin1 NOT NULL DEFAULT '',
  `display` varchar(10) CHARACTER SET latin1 NOT NULL,
  `featured` varchar(3) CHARACTER SET latin1 NOT NULL DEFAULT '',
  `block` varchar(100) CHARACTER SET latin1 NOT NULL,
  `transportation` varchar(250) CHARACTER SET latin1 NOT NULL,
  `pageTitle` text CHARACTER SET latin1 NOT NULL,
  `pageKeyword` text CHARACTER SET latin1 NOT NULL,
  `activity` varchar(100) CHARACTER SET latin1 NOT NULL,
  `publish` varchar(3) CHARACTER SET latin1 NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `groups`
--

INSERT INTO `groups` (`id`, `name`, `nameen`, `urlname`, `type`, `parentId`, `shortcontents`, `shortcontentsen`, `contents`, `contentsen`, `linkType`, `weight`, `hide`, `onDate`, `image`, `display`, `featured`, `block`, `transportation`, `pageTitle`, `pageKeyword`, `activity`, `publish`) VALUES
(56, '&#2327;&#2371;&#2361; &#2346;&#2371;&#2359;&#2381;&#8205;&#2336;', 'Home', 'home', 'Header', 0, '', '', 'home', '', 'Link', 10, 'no', '2012-12-13', '', 'normal', 'No', '', '', '', '', '', ''),
(176, 'चापागाई परिवार समाजमा तपाइहरु लाइ स्वागत छ', 'चापागाई परिवार समाजमा तपाइहरु लाइ स्वागत छ', 'welcome-to-chapagain-family', 'Other', 0, 'चापागाईहरू महर्षि अत्रि र माता अनुसूयाका सन्तानहुन । ब्रह्माका मानसपुत्र अत्रि सप्तर्षि मध्यका एक हुन । महर्षी अत्रिको उतपत्ति श्वेतमनमन्तर कालमा भयेको धियो । जहाँ वैवश्वत मन्वन्तर कालमा पनि सप्तर्षिका रूपमा महर्षि अत्रि रहेका छन । ब्रम्हाजीले सृष्टिको आग्रह गर्दा सप्तर्षिको उतपत्ति भयो र महर्षि अत्रि ब्रह्माका चक्षुस्वरूप स्थिर भये । त्यसकारण महर्षि अत्रिलाई ग्यानका स्वरूप मानिन्छ । महर्षि अत्रि प्रजापति पनि हुन । अत्रि स्मृति ग्रन्थ, अत्रि संहिता, आचार संहिता, वेदान्त शास्त्र, केहि वैदिक मत्रं अत्रिका कृति रचना हुन । ऋगवेदका पाँचौं मण्डलका द्रष्टा र रामायणकालका पुरुषोत्तम भगवान श्रीरामचन्द्र जगत पिता महर्षी अत्रिको चित्रकुट आश्रम दर्शन गरि धन्य भयेको उल्लेख ग्रन्थमा माईन्छ । चित्रकुट वनमा कर्दन ऋषिकी पुत्री माता अनुसूयाले माता सीताजीलाई पतिव्रता धर्मको शिक्षा दिएकी थिइन । सीता साध्वीका रूपमा माता आनुसूया श्रेष्ठ छन ।&nbsp;<br />\r\nब्रह्माजीको आग्रह थियो महर्षी र ऋषि पत्नि अनुसूयाबाट सन्तानहरूको जन्म होस । महर्षी अत्रि र अनुसूया बिना तपस्या सन्तान सृष्टि नगर्ने भये र तपस्या गर्नलागे । यो तपस्यामा ब्रह्मा विष्णु र महेश्वर खुशी भयेर ब्रह्मा स्वभावले सोम (चन्द्रमा), विष्णु स्वभावले आत्रेय (दत्तात्रय) र महेश्वर स्वभावले महामुनी दुर्वासा ऋषि अत्रि र अनुसूयाका पुत्रका रूपमा जन्मलिए । महर्षि अत्रिको प्राचीन इतिहास &#39;अजरबैजान राज्यमा&#39; अझै पाईन्छ भनिन्छ । सर्वप्रथम वस्त्रपहिरणको सुरू हाम्रा जगत पिता महर्षी अत्रि र जगतमाता अनुसूयाले गरेका थिए भन्ने कुरा रामायनले उल्लेख गरेको छ ।<br />\r\nभारतवर्षका प्राचीन राजवंश अत्रि सोम वा चन्द्रवंशकै थिए । अत्रिवंशका राजा पुरुखा, बुध, नहुष, ययाती, मल्ल आदि हुन । द्वापरका भगवान कृष्ण चद्रवंशी हुन । पाण्डव वंश, यदुवंश, पांचालवंश सबै चन्द्रवंशकै मानिन्छन ।&nbsp;<br />\r\nकालान्तरमा लव, कुशका वशंधरहरूले उत्तरी भारत देखी पाकिस्तान र अफगानिस्तानसम्म आफ्नो राज्य विस्तार गरे । यसरी कुनै राज्य पतन भये र कुनै अन्यवंशोद्भवको राज्य स्थापन भयो । पछि यी राथज्यहरू खस, किराँत र मल्लहरू द्वारा शासित थिए । यी राज्यहरू सबैमा हिन्दुधर्मको प्रभाव पर्नाले कान्यकुब्जी हिन्दु ब्राह्मणहरू तल समतलमा हिन्दुब्राह्मणहरू माथी चलेको यवनहरूको दमनले यी हिन्दुब्राह्मणहरू गढवाल, कुमाउ र नेपालको पहाडीक्षेत्रमा धर्मसुरक्षा खोजेर खस, किराँतहरूसँग मिलेर बस्नलागे । यी राज्यहरूमा हिन्दुधर्म नै मुख्य हुनाले ब्राह्मणहरू सत्कारीत भये र शिक्षित र विद्वान समुहका रूपमा चिनिए । हिन्दु संस्कार भयेका यी राज्यका राजाहरूलाई पनि ब्राह्मणको खाँचो भयो र ब्राह्मणहरू अन्यत्र जानथाले ।&nbsp;<br />\r\nवैदिक आर्यहरूको प्राचीन थलो सिन्धु नदिको वारी पारीको भूभाग हो । महर्षी अत्रिको पनि यहि सप्तसिन्धू (पंजाब प्रदेश) कै भूभाग मूल थलो थियो । प्राचीन पुराणादि ग्रन्थमा उल्लेख गरेका राज्यहरू गंगाजी, यमुना, ब्रह्मपुत्र आदि नद नदिका छेउछाउ स्थापित थिए जुन आर्य संस्कारित थिए । अत्रिवंशोद्भव आजका क्षत्रियहरू पनि ब्राह्मण कै शाखा सन्तति हुन ।', 'चापागाईहरू महर्षि अत्रि र माता अनुसूयाका सन्तानहुन । ब्रह्माका मानसपुत्र अत्रि सप्तर्षि मध्यका एक हुन । महर्षी अत्रिको उतपत्ति श्वेतमनमन्तर कालमा भयेको धियो । जहाँ वैवश्वत मन्वन्तर कालमा पनि सप्तर्षिका रूपमा महर्षि अत्रि रहेका छन । ब्रम्हाजीले सृष्टिको आग्रह गर्दा सप्तर्षिको उतपत्ति भयो र महर्षि अत्रि ब्रह्माका चक्षुस्वरूप स्थिर भये । त्यसकारण महर्षि अत्रिलाई ग्यानका स्वरूप मानिन्छ । महर्षि अत्रि प्रजापति पनि हुन । अत्रि स्मृति ग्रन्थ, अत्रि संहिता, आचार संहिता, वेदान्त शास्त्र, केहि वैदिक मत्रं अत्रिका कृति रचना हुन । ऋगवेदका पाँचौं मण्डलका द्रष्टा र रामायणकालका पुरुषोत्तम भगवान श्रीरामचन्द्र जगत पिता महर्षी अत्रिको चित्रकुट आश्रम दर्शन गरि धन्य भयेको उल्लेख ग्रन्थमा माईन्छ । चित्रकुट वनमा कर्दन ऋषिकी पुत्री माता अनुसूयाले माता सीताजीलाई पतिव्रता धर्मको शिक्षा दिएकी थिइन । सीता साध्वीका रूपमा माता आनुसूया श्रेष्ठ छन ।&nbsp;<br />\r\nब्रह्माजीको आग्रह थियो महर्षी र ऋषि पत्नि अनुसूयाबाट सन्तानहरूको जन्म होस । महर्षी अत्रि र अनुसूया बिना तपस्या सन्तान सृष्टि नगर्ने भये र तपस्या गर्नलागे । यो तपस्यामा ब्रह्मा विष्णु र महेश्वर खुशी भयेर ब्रह्मा स्वभावले सोम (चन्द्रमा), विष्णु स्वभावले आत्रेय (दत्तात्रय) र महेश्वर स्वभावले महामुनी दुर्वासा ऋषि अत्रि र अनुसूयाका पुत्रका रूपमा जन्मलिए । महर्षि अत्रिको प्राचीन इतिहास &#39;अजरबैजान राज्यमा&#39; अझै पाईन्छ भनिन्छ । सर्वप्रथम वस्त्रपहिरणको सुरू हाम्रा जगत पिता महर्षी अत्रि र जगतमाता अनुसूयाले गरेका थिए भन्ने कुरा रामायनले उल्लेख गरेको छ ।<br />\r\nभारतवर्षका प्राचीन राजवंश अत्रि सोम वा चन्द्रवंशकै थिए । अत्रिवंशका राजा पुरुखा, बुध, नहुष, ययाती, मल्ल आदि हुन । द्वापरका भगवान कृष्ण चद्रवंशी हुन । पाण्डव वंश, यदुवंश, पांचालवंश सबै चन्द्रवंशकै मानिन्छन ।&nbsp;<br />\r\nकालान्तरमा लव, कुशका वशंधरहरूले उत्तरी भारत देखी पाकिस्तान र अफगानिस्तानसम्म आफ्नो राज्य विस्तार गरे । यसरी कुनै राज्य पतन भये र कुनै अन्यवंशोद्भवको राज्य स्थापन भयो । पछि यी राथज्यहरू खस, किराँत र मल्लहरू द्वारा शासित थिए । यी राज्यहरू सबैमा हिन्दुधर्मको प्रभाव पर्नाले कान्यकुब्जी हिन्दु ब्राह्मणहरू तल समतलमा हिन्दुब्राह्मणहरू माथी चलेको यवनहरूको दमनले यी हिन्दुब्राह्मणहरू गढवाल, कुमाउ र नेपालको पहाडीक्षेत्रमा धर्मसुरक्षा खोजेर खस, किराँतहरूसँग मिलेर बस्नलागे । यी राज्यहरूमा हिन्दुधर्म नै मुख्य हुनाले ब्राह्मणहरू सत्कारीत भये र शिक्षित र विद्वान समुहका रूपमा चिनिए । हिन्दु संस्कार भयेका यी राज्यका राजाहरूलाई पनि ब्राह्मणको खाँचो भयो र ब्राह्मणहरू अन्यत्र जानथाले ।&nbsp;<br />\r\nवैदिक आर्यहरूको प्राचीन थलो सिन्धु नदिको वारी पारीको भूभाग हो । महर्षी अत्रिको पनि यहि सप्तसिन्धू (पंजाब प्रदेश) कै भूभाग मूल थलो थियो । प्राचीन पुराणादि ग्रन्थमा उल्लेख गरेका राज्यहरू गंगाजी, यमुना, ब्रह्मपुत्र आदि नद नदिका छेउछाउ स्थापित थिए जुन आर्य संस्कारित थिए । अत्रिवंशोद्भव आजका क्षत्रियहरू पनि ब्राह्मण कै शाखा सन्तति हुन ।', '<p style=\"text-align:justify\">चापागाईहरू महर्षि अत्रि र माता अनुसूयाका सन्तानहुन । ब्रह्माका मानसपुत्र अत्रि सप्तर्षि मध्यका एक हुन । महर्षी अत्रिको उतपत्ति श्वेतमनमन्तर कालमा भयेको धियो । जहाँ वैवश्वत मन्वन्तर कालमा पनि सप्तर्षिका रूपमा महर्षि अत्रि रहेका छन । ब्रम्हाजीले सृष्टिको आग्रह गर्दा सप्तर्षिको उतपत्ति भयो र महर्षि अत्रि ब्रह्माका चक्षुस्वरूप स्थिर भये । त्यसकारण महर्षि अत्रिलाई ग्यानका स्वरूप मानिन्छ । महर्षि अत्रि प्रजापति पनि हुन । अत्रि स्मृति ग्रन्थ, अत्रि संहिता, आचार संहिता, वेदान्त शास्त्र, केहि वैदिक मत्रं अत्रिका कृति रचना हुन । ऋगवेदका पाँचौं मण्डलका द्रष्टा र रामायणकालका पुरुषोत्तम भगवान श्रीरामचन्द्र जगत पिता महर्षी अत्रिको चित्रकुट आश्रम दर्शन गरि धन्य भयेको उल्लेख ग्रन्थमा माईन्छ । चित्रकुट वनमा कर्दन ऋषिकी पुत्री माता अनुसूयाले माता सीताजीलाई पतिव्रता धर्मको शिक्षा दिएकी थिइन । सीता साध्वीका रूपमा माता आनुसूया श्रेष्ठ छन ।&nbsp;<br />\r\nब्रह्माजीको आग्रह थियो महर्षी र ऋषि पत्नि अनुसूयाबाट सन्तानहरूको जन्म होस । महर्षी अत्रि र अनुसूया बिना तपस्या सन्तान सृष्टि नगर्ने भये र तपस्या गर्नलागे । यो तपस्यामा ब्रह्मा विष्णु र महेश्वर खुशी भयेर ब्रह्मा स्वभावले सोम (चन्द्रमा), विष्णु स्वभावले आत्रेय (दत्तात्रय) र महेश्वर स्वभावले महामुनी दुर्वासा ऋषि अत्रि र अनुसूयाका पुत्रका रूपमा जन्मलिए । महर्षि अत्रिको प्राचीन इतिहास &#39;अजरबैजान राज्यमा&#39; अझै पाईन्छ भनिन्छ । सर्वप्रथम वस्त्रपहिरणको सुरू हाम्रा जगत पिता महर्षी अत्रि र जगतमाता अनुसूयाले गरेका थिए भन्ने कुरा रामायनले उल्लेख गरेको छ ।<br />\r\nभारतवर्षका प्राचीन राजवंश अत्रि सोम वा चन्द्रवंशकै थिए । अत्रिवंशका राजा पुरुखा, बुध, नहुष, ययाती, मल्ल आदि हुन । द्वापरका भगवान कृष्ण चद्रवंशी हुन । पाण्डव वंश, यदुवंश, पांचालवंश सबै चन्द्रवंशकै मानिन्छन ।&nbsp;<br />\r\nकालान्तरमा लव, कुशका वशंधरहरूले उत्तरी भारत देखी पाकिस्तान र अफगानिस्तानसम्म आफ्नो राज्य विस्तार गरे । यसरी कुनै राज्य पतन भये र कुनै अन्यवंशोद्भवको राज्य स्थापन भयो । पछि यी राथज्यहरू खस, किराँत र मल्लहरू द्वारा शासित थिए । यी राज्यहरू सबैमा हिन्दुधर्मको प्रभाव पर्नाले कान्यकुब्जी हिन्दु ब्राह्मणहरू तल समतलमा हिन्दुब्राह्मणहरू माथी चलेको यवनहरूको दमनले यी हिन्दुब्राह्मणहरू गढवाल, कुमाउ र नेपालको पहाडीक्षेत्रमा धर्मसुरक्षा खोजेर खस, किराँतहरूसँग मिलेर बस्नलागे । यी राज्यहरूमा हिन्दुधर्म नै मुख्य हुनाले ब्राह्मणहरू सत्कारीत भये र शिक्षित र विद्वान समुहका रूपमा चिनिए । हिन्दु संस्कार भयेका यी राज्यका राजाहरूलाई पनि ब्राह्मणको खाँचो भयो र ब्राह्मणहरू अन्यत्र जानथाले ।&nbsp;<br />\r\nवैदिक आर्यहरूको प्राचीन थलो सिन्धु नदिको वारी पारीको भूभाग हो । महर्षी अत्रिको पनि यहि सप्तसिन्धू (पंजाब प्रदेश) कै भूभाग मूल थलो थियो । प्राचीन पुराणादि ग्रन्थमा उल्लेख गरेका राज्यहरू गंगाजी, यमुना, ब्रह्मपुत्र आदि नद नदिका छेउछाउ स्थापित थिए जुन आर्य संस्कारित थिए । अत्रिवंशोद्भव आजका क्षत्रियहरू पनि ब्राह्मण कै शाखा सन्तति हुन ।&nbsp;<br />\r\nमहर्षी अत्रिका वंश चापागाईका पुर्वपुरुष खोजि गर्दा चापागाईका सगोत्रीहरूको थर उल्लेख नगरि हुँदैन । यी सगोत्रीहरूहुन - गोतामे, खतिवडा, राउत, ओझा, मिश्र, विष्ठ, अवस्थि, पाहारी, पाठक, ठाडाराई अधिकारी, डांगी, खँडका, भूल, मल्ल, सिर्ध, जोशी, शाही, वर्मा, रावल, डोटेल र कडरीया ।<br />\r\nनानामुनि नाना मत भनेजस्तो माथी लेखिएका थरीहरूसंग चापागाईहरूको शाखा छुट्टिएको स्पष्ट मत कहि भेटिएको छैन । यी थरीहरूसंग चापागाईहरूको शरीर रूप-वर्णको चर्चा नै गर्दा पनि कुनै ठोस कुरा उल्लेख गर्न सकिन्न । खतिवडा, मल्ल, गोतामे, शाही थरीहरूसंग चापागाईहरूको प्रकृति केहि मिल्दोजुल्दो देखिएता पनि को कस्का पूर्वहुन भन्नेकुरा ठम्म्याउन सकिएको छैन । विभिन्न जनाले चापागाईँका पूर्वपुरुषको नाम भिन्ना भिन्नै उल्लेख गरेको पाईन्छ । आजको प्रामाणिक तथ्य मुताविक नेपाल भूभागका चापागाईहरू सप्तसिन्धुका डोटी राज्यमा जाने कनौज ब्राह्मणहरूका वंशोद्भव हुन ।&nbsp;<br />\r\nअत्रिवंश चापागाई वंशावली निर्माताहरूको अभिमत के छ भने - स्यांजाका जग्गनाथ&nbsp;चापागांई ले लेखेको बृहत् अत्रिगोत्रीय वंशावलीमा, गैंडाकोटका डोलराज चापागाईंको चापागाईं वंशावली र विश्वनाथ चापागाईंले दिंलाली चापागाईंको चापागाईं वंश गीतामा कनौजी ब्राह्मणका चार भाई मास्कर, प्रभास्कर, लल्ल र विल्ल थिए भन्नेकुरामा सहमत राखेको देखिन्छ । यी चार भाईका सन्तानहरूमा लल्लकका सन्तान अत्रि गोत्रीय हुन भनिएको छ ।&nbsp;<br />\r\nअझ भन्नु पर्दा योगी नरहरीनाथ, मिश्र, खतिवडा, कडरीया र बृहत् अत्रि गोत्रीय वंशावलीले लल्लका सन्तान चापागाईहरू हुन भन्ने प्रष्ट मत पोषण गरेका छन ।&nbsp;<br />\r\nदिंलाली चापागाई डा. नरेन्द्रराज चापागाईले चापागाई थर कसरी रह्यो भन्ने सम्वन्धमा भरपर्दो कुरो राखेका छन । थरहरू विशेषत राज सम्पर्क र ठाँउबाट आएका छन भन्ने उनको विचार नकार्न सकिन्न । उनको विचारमा हिमालवारी र हिमाल पारि तिब्बतको कतिअंश नागराज हिउजिउका वंश चाप राजेले दिएको विर्ता पाउने चापग्रामवासीहरू चापागाई कहलाईए ।<br />\r\nस्यांजाको चापागाँउ, काठमाण्डुको चापागाउ, राजस्थानको चापागाउँ, दैलेख, जुम्ला, आछाम, रुकुम र लाभु आदिका चाप जोडिएका गाँउहरू पनि धेरै तर्कमा राखेको पाइन्छ । (नेपालका केहि ठाँउहरूको अवस्थान- पाटन - ललितपुर, सिन्धुपाल्चोक- वागमति अन्चल, डोटी-सिलगढी सेती अंचल)<br />\r\nयहाँ आएर म के भन्न चाहन्छु भने उत्तर भारतका संस्कारीत कनौज ब्राह्मणहरू हिन्दु धर्मी प्राचीन आर्य र किराँत सँग मिलेर बसेका थिए । यीनै ब्राह्मणहरूका एक सन्तान विद्यवासिनी भगवती (उत्तर प्रदेश)को पूजा आराधना गरि बसे र उनका सन्तान बाट फैलिएको वंश नै यत्रतत्र छरिएर बसेका आजका चापागाईहरू हुन ।<br />\r\nकाश्यप, अत्रि, भरद्वाज, गौतम, विश्वामित्र, जमदग्नि र वशिष्ठ ऋषि आदि हिमालय खण्डमै सृष्टि भयेका र आर्यवर्तका अनेक ठाँउमा तपस्या गरि प्रतापी भयेका अष्ठासी हजार यी ऋषिहरूले मरुत आदि राजाहरूका यग्य-यग्यादि गराएका थिए । पं. पदमप्रसाद उपाध्यायले यसो भनेकाछन &quot;जम्बुद्वीपको उत्तरी भेक देखि नेपालका पशुपति, गुज्येश्वरी देवालय र काली गण्डकी, वागमती किनारमा राम्रो हवापानीका कारण तपस्या गर्दै आएका ऋषि मुनिका सन्तति यत्रतत्र छरिए । कालक्रममा यी कान्यकुब्जी ब्राह्मणहरू पाटन, भादगाँउ, गोर्खा इत्यादि ठाँउमा किरात नेवार क्षत्रियहरूका घरमा कर्मकाण्ड, यग्यादि गराउन लागे ।&quot;&nbsp;<br />\r\nदक्षिणी ब्राह्मणहरू पनि हिमालय क्षेत्रबाटै गयेका हुन । नदिहरूका बिचमा बसेका यिनका सन्ततिहरू अन्तर्वर्ती या कनौजी भये र पारि या सरयु र मथुरा तिर बस्ने सन्ततिहरू दक्षिणी वा गौड ब्राह्मण भये । त्यसरी नै पश्चिम मा बस्ने पश्चिमा ब्राह्मण र पूर्वी भेकमा बस्ने पूर्वेली ब्राह्मण भनेर चिनिए ।&nbsp;<br />\r\nनेपाली थर वंशावलीमा धेरैले कुशभद्र र उदयभद्र(लव)लाई आफ्ना प्राचीन पूर्वपुरुष मानेको पाइन्छ । वंशावलीको प्राचीन इतिहास खोज्नु भनेको सजिलो होइन । यी कुराहरू प्रति ध्यान राखेर वंशावलीका निर्माताहरूले चापागाई वंशका सर्वप्रथम पुरुषका रुपमा श्रीधर चापागाईको नाम उल्लेख गरेका छन । यहिँ पनि स्पष्ट मत छैन नै भन्न सकिन्छ । बालकृष्ण पोख्रेलको कलममा के उल्लेख छ भने अभय मल्ल (वि.स. १७२०)को पतन पछि लक्ष्मीधर नामका ब्राह्मण खिदिम गये । खिदिममा उनी गोतामे भनेर चिनिए । तर उनी लाभुको चापागाँउबाट खिदिम गयेका हुनाले त्यसकुराले उनी आफुलाई गर्वबोध भयो । यहिँबाट उनका सन्ततिहरू आफुलाई चागाई कहनलागे भनेता पनि उनका छोरा श्रीधरले आफुलाई चापागाई भने र श्रीधरका सन्ततिहरू चापागाईहुन भन्ने पोख्रेलको विद्वतामा प्रकाश पाएको छ ।&nbsp;<br />\r\nचापागाई वंशावलीका सवै निर्माताहरूले श्रीधर नै चापागाई थरका प्रथम मानेको पाइन्छ । पर्वत देउपुरका परमानन्द चापागाईको सानो वंशावलीमा वि.स.१७४१ मा प्रताप मल्लले देउपुरको गैराथोक भन्नेठाउमा ल्याएका पूर्खाका सातौं सन्तान श्रीधर चापागाई उल्लेख गरेका छन । तर उनको वंशावली चापागाई भाइ मुठोमा उल्लेखित परमानन्दको आफ्नो वंश पुस्ता क्रममा विस. १७४० श्रीधर चापागाईलाई मात्र लिन सकिन्छ । किन भने श्रीधर का सातौं पुर्खा १७४० अघि छुटेको बुझिन्छ ।&nbsp;<br />\r\nयसरी यो सम्वद पनि त्यत्ति ग्रहणीय मान्न सकिन्न । दिंलाली चापागाईका पुर्वपुरुष सिन्धुपाल्चोक जिलाको दुवाचौर बाट आएका र सिन्धुपाल्चोकको महाकालमा रहेको शिलापत्र मुताविक वि.स. १७०० तिर श्रीधरका सन्तानहरूको बसोवास थियो । देउपुरका परमानन्दसंग र सिन्धुपाल्चोकको महाकालमा पाइएका ऐतिहासिक लेख समसामयीक फेला परेका छन । चापागाईहरूका वंशावलीमा पनि यहि समयलाई किटान गरि वंशावली तैयार गरेको देखिन्छ । श्रीधर चापागाईका सन्ततिको समयसाल १६००/१७०० सत्य सावित भयेको छ । यस सन्दर्भमा यो आलोचना अघिसार्न खोजे जुन कुराले श्रीधर चापागाईसम्मका चापागाई पुर्खाको नामावली संग्लो हुनेछ । लगभग वि.स. सत्रसय सम्मको चापागाईका एक सन्ततिका सन्तानहरूले आफ्ना पुर्ख्याका नामावली विशुद्ध राखेका छन । म आफु पनि यति भन्नसक्छु &quot;हाम्रा पुर्खा १७०० साल अघिपछिको समयमा सिन्धुपाल्चोकमा थिए । उनीहरूले गोकुल सम्मका नाममा तर्पण दिइ आएका थिए । गोकुल चापागाईको समयसाल १६०० भित्र देखिन्छ । यसरी सिन्धुपाल्चोक र पर्वतका चापागाईहरू संग अहिले जुन ऐतिहासीक तत्थ्य छ त्यो तत्थ्यले आजका नेपाल, भारतमा छरिएर बसेका चापागाईहरूको वंशावली निर्माणमा ठूलो सहयोग पुर्याएको छ ।&nbsp;<br />\r\nपरमानन्दको पर्वतेली चापागाईहरूको वंशावलीले श्रीधर पछिका सन्तान चन्द्रमा चापागाई नामका श्रीधरका एक सन्ततिलाई प्रताप मल्लले देउपुर लगेकाथिए भन्ने कुरा बुझ्न सकिन्छ । सिन्धुपाल्चोकमा चापागाईको आगमन पनि यहि समय हो ।&nbsp;<br />\r\nउक्त आलोचनाबाट के कौतुहल जाग्छ भने सिन्धुपाल्चोक र देउपुरका चापागाईहरूका श्रीधरसम्मका पुर्खाहरूको नाम कतिसम्म सँच्याउन र केलाउन सकेका छौं ? ती पुर्खाहरू कहाँबाट आएका थिए ?&nbsp;<br />\r\nवी.स. २०७४ को प्रारम्भमा चापागाई बन्धुको खोजि गरि म स्यांजा पुगेको थिएँ । स्यांजा बजारमा बन्धुको खोजि गरि म एकजना भाईको आतिथ्यमा पुगें । भाइको परिचय लिँदा उनले आफुहरूले आज पनि चपाई थर लेखि आएको कुरा सुनाए । यसरी यी कुराले स्यांजाका चापागाईहरूको पनि बसोवास ऐतिहासिक देखिन्छ । चपाई र चापागाई कुन अघिको हो भन्ने कुरा छुट्याउन सजिलो छैन । स्यांजाका जगन्नाथको वंशावलीमा पनि यस विषयमा विशेष कुरा उल्लेख भयेको छैन । यसै प्रसंगमा फेरि के भन्न चाहन्छु भने डा. खेमराजको पुस्तक अनुवाद गरि लोकनाथ चापागाईले के लेखेका छन भने - दार्जीलिंमा रहेका राईगाँउ, गुरुंगवस्ती, प्रधान नगर जस्ता नामहरू जात जातिको बसोवास बाटै सँष्टि भयेका हुन । त्यस्तै संखुवासभाको नाम आफ्नै प्रकारको छ । परापुर्वकालमा त्यहाँ ऋषिमुनिहरूको सभा बसेको हुनाले संखुवासभा नामरहेको भन्ने जनजनको भनाई छ । खाँदबारीमा चापागाईडाँडा भन्ने एउटा गाँउनै छ जँहा चापागाईहरूको बसोवासो थियो । तर यो चापागाई डाँडाको इतिहास सिन्धुपाल्चोकको दुवाचौरबाट आएका धर्मानन्द पाध्याका सन्तति हुन । यहाँसम्म जति चापागाईगाँउ बस्तीका नाम पाइएको छ यो पुरानो हो तर प्राचीन होइन ।&nbsp;<br />\r\nलोकनाथको अनुवाद.पुस्तकले अर्को केकुरा प्रष्ट पारेको छ भने &quot;नेपाल र सिक्कीम बिच भयेको युद्ध (1788 सन तदनुसार वि.स. १८४६?) र अंगरेजहरूसंगको भारत नेपाल सन्धि चुक्ति पछि आसामको सुनकोस देखि पंजाबको सतलजसम्मका भूभागको शासन परिवर्तनका कारण ती भूमिका बासिन्दा ईच्छानुसार आजको नेपाल र भारतका विभिन्न ठाँउमा सरुवा भै स्थायी भये ।&quot; जसरी नेपालबाट लिम्बुहरू दार्जीलिं पसे त्यस्तै चापागाईहरू भारतका विभिन्न ठाउँमा बसोवास गर्नलागे । आज नेपाल र भारतको सिक्कीम, पश्चिमबंगाल, आसाम एवं उत्तर पूर्वांचलका सबै राज्यमा जहाँ जे जति चापागाँईहरू छन सबै गोकुल चापागाईका सन्ततिका समसामयिक अन्य पुर्खाका सन्तान सन्तति हुन । उनीहरूसंगको आफ्नो पुर्ख्याउली इतिहास विक्रमसम्वद १७००-१८०० पछिको मात्रै छ ।<br />\r\nतर लोकनाथको पुस्तकमा एउटा घतलाग्दो कुरा के छ भने &quot;दार्जीलिंमा रहेको महाकाल मन्दिर महाकाल डाँडामा विशघर परिवार थिए (1876सन /विस १९३४मा स्थापना भैसकेको।&quot; यता नेपालको सिन्धुपाल्चोकको महाकाल विस १६००-१७००(स्थापनाकाल) को पनि अवस्था त्यस्तै थियो । यी दुई स्थानको दुरत्व र दुर्गमता हुँदाहुँदै एकै देवनाम र जाति एवं एकै पहाडी भौगोलिक स्थानमा देवालय र वस्ती बस्नुले पनि धेरै कुराको संकेत गरेको छ ।&nbsp;<br />\r\nउफरोक्त विषय जे नै भयेता पनि चापागाईहरूका केहि वंशावली बनिएका छन । यी वंशावलीमा आफुहरूले आआफ्नो वंशलता यस प्रकार देखाएका छन -&nbsp;<br />\r\n1) देउपुरका परमानन्द&nbsp;<br />\r\nचन्द्रमा अंशुराम दुर्योधन वाचस्पति कपिलदेव धर्मदेव श्रीधर ध्रुवलाल अंशुराम वाचस्पति श्रीहर्क जोखुराम नाथुराम परमानन्द अनन्त सेउराम कन्चन भवदत्त परमानन्द ।<br />\r\n2) जगन्नाथको वंशावली<br />\r\nअग्निदेव वषिष्टभट्ट कमलापति काशिदास जयनारायण अमरदेव काशिदास लल्लक गोतमदास हरिदास ग्यानदास देवीलाल चामुपाध्या सिद्धुपाध्या बालानन्द लोचनदेव कामदेव देविप्रसाद जगन्नाथ ।<br />\r\n3) डोलराजको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधर विष्णुदत्त पूष्पनिधि धनपति हरिनारायण विश्वामित्र गोविन्द श्रीकृष्ण माधव सुन्दर बालाकृष्ण हरिदास देवदत्त शिवनारायण किसानदास माधव सन्तदेव वंशमुनि हरिनारायण बालाकृष्ण बिद्धु हरिलाल दिवाखर डोलराज ।<br />\r\n4) विश्वनाथको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधरका सन्तति दैलेख स्यांजाबाट सिन्धुपाल्चोक नैनानन्द देवनारायण नारायणपाध्या धनपति लक्ष्मीप्रसाद गिरीराज कालिका विश्वनाथ ।&nbsp;<br />\r\n5) लेखकको आफ्नो&nbsp;<br />\r\nसैगुण सन्तति श्रीधरका एक सन्तति ध्रुवनारायण का सन्तान गोकुल नैनान्द देवनारायण नारायणपाध्या धर्मानन्द डिल्लीकेशर काशिनाथ ग्यानप्रसाद योगप्रसाद(लेखक) ।</p>\r\n', '<p style=\"text-align:justify\">चापागाईहरू महर्षि अत्रि र माता अनुसूयाका सन्तानहुन । ब्रह्माका मानसपुत्र अत्रि सप्तर्षि मध्यका एक हुन । महर्षी अत्रिको उतपत्ति श्वेतमनमन्तर कालमा भयेको धियो । जहाँ वैवश्वत मन्वन्तर कालमा पनि सप्तर्षिका रूपमा महर्षि अत्रि रहेका छन । ब्रम्हाजीले सृष्टिको आग्रह गर्दा सप्तर्षिको उतपत्ति भयो र महर्षि अत्रि ब्रह्माका चक्षुस्वरूप स्थिर भये । त्यसकारण महर्षि अत्रिलाई ग्यानका स्वरूप मानिन्छ । महर्षि अत्रि प्रजापति पनि हुन । अत्रि स्मृति ग्रन्थ, अत्रि संहिता, आचार संहिता, वेदान्त शास्त्र, केहि वैदिक मत्रं अत्रिका कृति रचना हुन । ऋगवेदका पाँचौं मण्डलका द्रष्टा र रामायणकालका पुरुषोत्तम भगवान श्रीरामचन्द्र जगत पिता महर्षी अत्रिको चित्रकुट आश्रम दर्शन गरि धन्य भयेको उल्लेख ग्रन्थमा माईन्छ । चित्रकुट वनमा कर्दन ऋषिकी पुत्री माता अनुसूयाले माता सीताजीलाई पतिव्रता धर्मको शिक्षा दिएकी थिइन । सीता साध्वीका रूपमा माता आनुसूया श्रेष्ठ छन ।&nbsp;<br />\r\nब्रह्माजीको आग्रह थियो महर्षी र ऋषि पत्नि अनुसूयाबाट सन्तानहरूको जन्म होस । महर्षी अत्रि र अनुसूया बिना तपस्या सन्तान सृष्टि नगर्ने भये र तपस्या गर्नलागे । यो तपस्यामा ब्रह्मा विष्णु र महेश्वर खुशी भयेर ब्रह्मा स्वभावले सोम (चन्द्रमा), विष्णु स्वभावले आत्रेय (दत्तात्रय) र महेश्वर स्वभावले महामुनी दुर्वासा ऋषि अत्रि र अनुसूयाका पुत्रका रूपमा जन्मलिए । महर्षि अत्रिको प्राचीन इतिहास &#39;अजरबैजान राज्यमा&#39; अझै पाईन्छ भनिन्छ । सर्वप्रथम वस्त्रपहिरणको सुरू हाम्रा जगत पिता महर्षी अत्रि र जगतमाता अनुसूयाले गरेका थिए भन्ने कुरा रामायनले उल्लेख गरेको छ ।<br />\r\nभारतवर्षका प्राचीन राजवंश अत्रि सोम वा चन्द्रवंशकै थिए । अत्रिवंशका राजा पुरुखा, बुध, नहुष, ययाती, मल्ल आदि हुन । द्वापरका भगवान कृष्ण चद्रवंशी हुन । पाण्डव वंश, यदुवंश, पांचालवंश सबै चन्द्रवंशकै मानिन्छन ।&nbsp;<br />\r\nकालान्तरमा लव, कुशका वशंधरहरूले उत्तरी भारत देखी पाकिस्तान र अफगानिस्तानसम्म आफ्नो राज्य विस्तार गरे । यसरी कुनै राज्य पतन भये र कुनै अन्यवंशोद्भवको राज्य स्थापन भयो । पछि यी राथज्यहरू खस, किराँत र मल्लहरू द्वारा शासित थिए । यी राज्यहरू सबैमा हिन्दुधर्मको प्रभाव पर्नाले कान्यकुब्जी हिन्दु ब्राह्मणहरू तल समतलमा हिन्दुब्राह्मणहरू माथी चलेको यवनहरूको दमनले यी हिन्दुब्राह्मणहरू गढवाल, कुमाउ र नेपालको पहाडीक्षेत्रमा धर्मसुरक्षा खोजेर खस, किराँतहरूसँग मिलेर बस्नलागे । यी राज्यहरूमा हिन्दुधर्म नै मुख्य हुनाले ब्राह्मणहरू सत्कारीत भये र शिक्षित र विद्वान समुहका रूपमा चिनिए । हिन्दु संस्कार भयेका यी राज्यका राजाहरूलाई पनि ब्राह्मणको खाँचो भयो र ब्राह्मणहरू अन्यत्र जानथाले ।&nbsp;<br />\r\nवैदिक आर्यहरूको प्राचीन थलो सिन्धु नदिको वारी पारीको भूभाग हो । महर्षी अत्रिको पनि यहि सप्तसिन्धू (पंजाब प्रदेश) कै भूभाग मूल थलो थियो । प्राचीन पुराणादि ग्रन्थमा उल्लेख गरेका राज्यहरू गंगाजी, यमुना, ब्रह्मपुत्र आदि नद नदिका छेउछाउ स्थापित थिए जुन आर्य संस्कारित थिए । अत्रिवंशोद्भव आजका क्षत्रियहरू पनि ब्राह्मण कै शाखा सन्तति हुन ।&nbsp;<br />\r\nमहर्षी अत्रिका वंश चापागाईका पुर्वपुरुष खोजि गर्दा चापागाईका सगोत्रीहरूको थर उल्लेख नगरि हुँदैन । यी सगोत्रीहरूहुन - गोतामे, खतिवडा, राउत, ओझा, मिश्र, विष्ठ, अवस्थि, पाहारी, पाठक, ठाडाराई अधिकारी, डांगी, खँडका, भूल, मल्ल, सिर्ध, जोशी, शाही, वर्मा, रावल, डोटेल र कडरीया ।<br />\r\nनानामुनि नाना मत भनेजस्तो माथी लेखिएका थरीहरूसंग चापागाईहरूको शाखा छुट्टिएको स्पष्ट मत कहि भेटिएको छैन । यी थरीहरूसंग चापागाईहरूको शरीर रूप-वर्णको चर्चा नै गर्दा पनि कुनै ठोस कुरा उल्लेख गर्न सकिन्न । खतिवडा, मल्ल, गोतामे, शाही थरीहरूसंग चापागाईहरूको प्रकृति केहि मिल्दोजुल्दो देखिएता पनि को कस्का पूर्वहुन भन्नेकुरा ठम्म्याउन सकिएको छैन । विभिन्न जनाले चापागाईँका पूर्वपुरुषको नाम भिन्ना भिन्नै उल्लेख गरेको पाईन्छ । आजको प्रामाणिक तथ्य मुताविक नेपाल भूभागका चापागाईहरू सप्तसिन्धुका डोटी राज्यमा जाने कनौज ब्राह्मणहरूका वंशोद्भव हुन ।&nbsp;<br />\r\nअत्रिवंश चापागाई वंशावली निर्माताहरूको अभिमत के छ भने - स्यांजाका जग्गनाथ&nbsp;चापागांई ले लेखेको बृहत् अत्रिगोत्रीय वंशावलीमा, गैंडाकोटका डोलराज चापागाईंको चापागाईं वंशावली र विश्वनाथ चापागाईंले दिंलाली चापागाईंको चापागाईं वंश गीतामा कनौजी ब्राह्मणका चार भाई मास्कर, प्रभास्कर, लल्ल र विल्ल थिए भन्नेकुरामा सहमत राखेको देखिन्छ । यी चार भाईका सन्तानहरूमा लल्लकका सन्तान अत्रि गोत्रीय हुन भनिएको छ ।&nbsp;<br />\r\nअझ भन्नु पर्दा योगी नरहरीनाथ, मिश्र, खतिवडा, कडरीया र बृहत् अत्रि गोत्रीय वंशावलीले लल्लका सन्तान चापागाईहरू हुन भन्ने प्रष्ट मत पोषण गरेका छन ।&nbsp;<br />\r\nदिंलाली चापागाई डा. नरेन्द्रराज चापागाईले चापागाई थर कसरी रह्यो भन्ने सम्वन्धमा भरपर्दो कुरो राखेका छन । थरहरू विशेषत राज सम्पर्क र ठाँउबाट आएका छन भन्ने उनको विचार नकार्न सकिन्न । उनको विचारमा हिमालवारी र हिमाल पारि तिब्बतको कतिअंश नागराज हिउजिउका वंश चाप राजेले दिएको विर्ता पाउने चापग्रामवासीहरू चापागाई कहलाईए ।<br />\r\nस्यांजाको चापागाँउ, काठमाण्डुको चापागाउ, राजस्थानको चापागाउँ, दैलेख, जुम्ला, आछाम, रुकुम र लाभु आदिका चाप जोडिएका गाँउहरू पनि धेरै तर्कमा राखेको पाइन्छ । (नेपालका केहि ठाँउहरूको अवस्थान- पाटन - ललितपुर, सिन्धुपाल्चोक- वागमति अन्चल, डोटी-सिलगढी सेती अंचल)<br />\r\nयहाँ आएर म के भन्न चाहन्छु भने उत्तर भारतका संस्कारीत कनौज ब्राह्मणहरू हिन्दु धर्मी प्राचीन आर्य र किराँत सँग मिलेर बसेका थिए । यीनै ब्राह्मणहरूका एक सन्तान विद्यवासिनी भगवती (उत्तर प्रदेश)को पूजा आराधना गरि बसे र उनका सन्तान बाट फैलिएको वंश नै यत्रतत्र छरिएर बसेका आजका चापागाईहरू हुन ।<br />\r\nकाश्यप, अत्रि, भरद्वाज, गौतम, विश्वामित्र, जमदग्नि र वशिष्ठ ऋषि आदि हिमालय खण्डमै सृष्टि भयेका र आर्यवर्तका अनेक ठाँउमा तपस्या गरि प्रतापी भयेका अष्ठासी हजार यी ऋषिहरूले मरुत आदि राजाहरूका यग्य-यग्यादि गराएका थिए । पं. पदमप्रसाद उपाध्यायले यसो भनेकाछन &quot;जम्बुद्वीपको उत्तरी भेक देखि नेपालका पशुपति, गुज्येश्वरी देवालय र काली गण्डकी, वागमती किनारमा राम्रो हवापानीका कारण तपस्या गर्दै आएका ऋषि मुनिका सन्तति यत्रतत्र छरिए । कालक्रममा यी कान्यकुब्जी ब्राह्मणहरू पाटन, भादगाँउ, गोर्खा इत्यादि ठाँउमा किरात नेवार क्षत्रियहरूका घरमा कर्मकाण्ड, यग्यादि गराउन लागे ।&quot;&nbsp;<br />\r\nदक्षिणी ब्राह्मणहरू पनि हिमालय क्षेत्रबाटै गयेका हुन । नदिहरूका बिचमा बसेका यिनका सन्ततिहरू अन्तर्वर्ती या कनौजी भये र पारि या सरयु र मथुरा तिर बस्ने सन्ततिहरू दक्षिणी वा गौड ब्राह्मण भये । त्यसरी नै पश्चिम मा बस्ने पश्चिमा ब्राह्मण र पूर्वी भेकमा बस्ने पूर्वेली ब्राह्मण भनेर चिनिए ।&nbsp;<br />\r\nनेपाली थर वंशावलीमा धेरैले कुशभद्र र उदयभद्र(लव)लाई आफ्ना प्राचीन पूर्वपुरुष मानेको पाइन्छ । वंशावलीको प्राचीन इतिहास खोज्नु भनेको सजिलो होइन । यी कुराहरू प्रति ध्यान राखेर वंशावलीका निर्माताहरूले चापागाई वंशका सर्वप्रथम पुरुषका रुपमा श्रीधर चापागाईको नाम उल्लेख गरेका छन । यहिँ पनि स्पष्ट मत छैन नै भन्न सकिन्छ । बालकृष्ण पोख्रेलको कलममा के उल्लेख छ भने अभय मल्ल (वि.स. १७२०)को पतन पछि लक्ष्मीधर नामका ब्राह्मण खिदिम गये । खिदिममा उनी गोतामे भनेर चिनिए । तर उनी लाभुको चापागाँउबाट खिदिम गयेका हुनाले त्यसकुराले उनी आफुलाई गर्वबोध भयो । यहिँबाट उनका सन्ततिहरू आफुलाई चागाई कहनलागे भनेता पनि उनका छोरा श्रीधरले आफुलाई चापागाई भने र श्रीधरका सन्ततिहरू चापागाईहुन भन्ने पोख्रेलको विद्वतामा प्रकाश पाएको छ ।&nbsp;<br />\r\nचापागाई वंशावलीका सवै निर्माताहरूले श्रीधर नै चापागाई थरका प्रथम मानेको पाइन्छ । पर्वत देउपुरका परमानन्द चापागाईको सानो वंशावलीमा वि.स.१७४१ मा प्रताप मल्लले देउपुरको गैराथोक भन्नेठाउमा ल्याएका पूर्खाका सातौं सन्तान श्रीधर चापागाई उल्लेख गरेका छन । तर उनको वंशावली चापागाई भाइ मुठोमा उल्लेखित परमानन्दको आफ्नो वंश पुस्ता क्रममा विस. १७४० श्रीधर चापागाईलाई मात्र लिन सकिन्छ । किन भने श्रीधर का सातौं पुर्खा १७४० अघि छुटेको बुझिन्छ ।&nbsp;<br />\r\nयसरी यो सम्वद पनि त्यत्ति ग्रहणीय मान्न सकिन्न । दिंलाली चापागाईका पुर्वपुरुष सिन्धुपाल्चोक जिलाको दुवाचौर बाट आएका र सिन्धुपाल्चोकको महाकालमा रहेको शिलापत्र मुताविक वि.स. १७०० तिर श्रीधरका सन्तानहरूको बसोवास थियो । देउपुरका परमानन्दसंग र सिन्धुपाल्चोकको महाकालमा पाइएका ऐतिहासिक लेख समसामयीक फेला परेका छन । चापागाईहरूका वंशावलीमा पनि यहि समयलाई किटान गरि वंशावली तैयार गरेको देखिन्छ । श्रीधर चापागाईका सन्ततिको समयसाल १६००/१७०० सत्य सावित भयेको छ । यस सन्दर्भमा यो आलोचना अघिसार्न खोजे जुन कुराले श्रीधर चापागाईसम्मका चापागाई पुर्खाको नामावली संग्लो हुनेछ । लगभग वि.स. सत्रसय सम्मको चापागाईका एक सन्ततिका सन्तानहरूले आफ्ना पुर्ख्याका नामावली विशुद्ध राखेका छन । म आफु पनि यति भन्नसक्छु &quot;हाम्रा पुर्खा १७०० साल अघिपछिको समयमा सिन्धुपाल्चोकमा थिए । उनीहरूले गोकुल सम्मका नाममा तर्पण दिइ आएका थिए । गोकुल चापागाईको समयसाल १६०० भित्र देखिन्छ । यसरी सिन्धुपाल्चोक र पर्वतका चापागाईहरू संग अहिले जुन ऐतिहासीक तत्थ्य छ त्यो तत्थ्यले आजका नेपाल, भारतमा छरिएर बसेका चापागाईहरूको वंशावली निर्माणमा ठूलो सहयोग पुर्याएको छ ।&nbsp;<br />\r\nपरमानन्दको पर्वतेली चापागाईहरूको वंशावलीले श्रीधर पछिका सन्तान चन्द्रमा चापागाई नामका श्रीधरका एक सन्ततिलाई प्रताप मल्लले देउपुर लगेकाथिए भन्ने कुरा बुझ्न सकिन्छ । सिन्धुपाल्चोकमा चापागाईको आगमन पनि यहि समय हो ।&nbsp;<br />\r\nउक्त आलोचनाबाट के कौतुहल जाग्छ भने सिन्धुपाल्चोक र देउपुरका चापागाईहरूका श्रीधरसम्मका पुर्खाहरूको नाम कतिसम्म सँच्याउन र केलाउन सकेका छौं ? ती पुर्खाहरू कहाँबाट आएका थिए ?&nbsp;<br />\r\nवी.स. २०७४ को प्रारम्भमा चापागाई बन्धुको खोजि गरि म स्यांजा पुगेको थिएँ । स्यांजा बजारमा बन्धुको खोजि गरि म एकजना भाईको आतिथ्यमा पुगें । भाइको परिचय लिँदा उनले आफुहरूले आज पनि चपाई थर लेखि आएको कुरा सुनाए । यसरी यी कुराले स्यांजाका चापागाईहरूको पनि बसोवास ऐतिहासिक देखिन्छ । चपाई र चापागाई कुन अघिको हो भन्ने कुरा छुट्याउन सजिलो छैन । स्यांजाका जगन्नाथको वंशावलीमा पनि यस विषयमा विशेष कुरा उल्लेख भयेको छैन । यसै प्रसंगमा फेरि के भन्न चाहन्छु भने डा. खेमराजको पुस्तक अनुवाद गरि लोकनाथ चापागाईले के लेखेका छन भने - दार्जीलिंमा रहेका राईगाँउ, गुरुंगवस्ती, प्रधान नगर जस्ता नामहरू जात जातिको बसोवास बाटै सँष्टि भयेका हुन । त्यस्तै संखुवासभाको नाम आफ्नै प्रकारको छ । परापुर्वकालमा त्यहाँ ऋषिमुनिहरूको सभा बसेको हुनाले संखुवासभा नामरहेको भन्ने जनजनको भनाई छ । खाँदबारीमा चापागाईडाँडा भन्ने एउटा गाँउनै छ जँहा चापागाईहरूको बसोवासो थियो । तर यो चापागाई डाँडाको इतिहास सिन्धुपाल्चोकको दुवाचौरबाट आएका धर्मानन्द पाध्याका सन्तति हुन । यहाँसम्म जति चापागाईगाँउ बस्तीका नाम पाइएको छ यो पुरानो हो तर प्राचीन होइन ।&nbsp;<br />\r\nलोकनाथको अनुवाद.पुस्तकले अर्को केकुरा प्रष्ट पारेको छ भने &quot;नेपाल र सिक्कीम बिच भयेको युद्ध (1788 सन तदनुसार वि.स. १८४६?) र अंगरेजहरूसंगको भारत नेपाल सन्धि चुक्ति पछि आसामको सुनकोस देखि पंजाबको सतलजसम्मका भूभागको शासन परिवर्तनका कारण ती भूमिका बासिन्दा ईच्छानुसार आजको नेपाल र भारतका विभिन्न ठाँउमा सरुवा भै स्थायी भये ।&quot; जसरी नेपालबाट लिम्बुहरू दार्जीलिं पसे त्यस्तै चापागाईहरू भारतका विभिन्न ठाउँमा बसोवास गर्नलागे । आज नेपाल र भारतको सिक्कीम, पश्चिमबंगाल, आसाम एवं उत्तर पूर्वांचलका सबै राज्यमा जहाँ जे जति चापागाँईहरू छन सबै गोकुल चापागाईका सन्ततिका समसामयिक अन्य पुर्खाका सन्तान सन्तति हुन । उनीहरूसंगको आफ्नो पुर्ख्याउली इतिहास विक्रमसम्वद १७००-१८०० पछिको मात्रै छ ।<br />\r\nतर लोकनाथको पुस्तकमा एउटा घतलाग्दो कुरा के छ भने &quot;दार्जीलिंमा रहेको महाकाल मन्दिर महाकाल डाँडामा विशघर परिवार थिए (1876सन /विस १९३४मा स्थापना भैसकेको।&quot; यता नेपालको सिन्धुपाल्चोकको महाकाल विस १६००-१७००(स्थापनाकाल) को पनि अवस्था त्यस्तै थियो । यी दुई स्थानको दुरत्व र दुर्गमता हुँदाहुँदै एकै देवनाम र जाति एवं एकै पहाडी भौगोलिक स्थानमा देवालय र वस्ती बस्नुले पनि धेरै कुराको संकेत गरेको छ ।&nbsp;<br />\r\nउफरोक्त विषय जे नै भयेता पनि चापागाईहरूका केहि वंशावली बनिएका छन । यी वंशावलीमा आफुहरूले आआफ्नो वंशलता यस प्रकार देखाएका छन -&nbsp;<br />\r\n1) देउपुरका परमानन्द&nbsp;<br />\r\nचन्द्रमा अंशुराम दुर्योधन वाचस्पति कपिलदेव धर्मदेव श्रीधर ध्रुवलाल अंशुराम वाचस्पति श्रीहर्क जोखुराम नाथुराम परमानन्द अनन्त सेउराम कन्चन भवदत्त परमानन्द ।<br />\r\n2) जगन्नाथको वंशावली<br />\r\nअग्निदेव वषिष्टभट्ट कमलापति काशिदास जयनारायण अमरदेव काशिदास लल्लक गोतमदास हरिदास ग्यानदास देवीलाल चामुपाध्या सिद्धुपाध्या बालानन्द लोचनदेव कामदेव देविप्रसाद जगन्नाथ ।<br />\r\n3) डोलराजको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधर विष्णुदत्त पूष्पनिधि धनपति हरिनारायण विश्वामित्र गोविन्द श्रीकृष्ण माधव सुन्दर बालाकृष्ण हरिदास देवदत्त शिवनारायण किसानदास माधव सन्तदेव वंशमुनि हरिनारायण बालाकृष्ण बिद्धु हरिलाल दिवाखर डोलराज ।<br />\r\n4) विश्वनाथको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधरका सन्तति दैलेख स्यांजाबाट सिन्धुपाल्चोक नैनानन्द देवनारायण नारायणपाध्या धनपति लक्ष्मीप्रसाद गिरीराज कालिका विश्वनाथ ।&nbsp;<br />\r\n5) लेखकको आफ्नो&nbsp;<br />\r\nसैगुण सन्तति श्रीधरका एक सन्तति ध्रुवनारायण का सन्तान गोकुल नैनान्द देवनारायण नारायणपाध्या धर्मानन्द डिल्लीकेशर काशिनाथ ग्यानप्रसाद योगप्रसाद(लेखक) ।</p>\r\n', 'Contents Page', 20, 'no', '2013-11-26', 'sajjad.php', 'normal', 'No', '', '', '', '', '', ''),
(860, 'लक्ष्मीश्वोर', 'Laxmiswor', 'laxmiswor', 'Other', 854, 'लक्ष्मीश्वोर', 'लक्ष्मीश्वोर', 'लक्ष्मीश्वोर', 'लक्ष्मीश्वोर', 'Contents Page', 60, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', ''),
(861, 'भानुदत्त', 'Bhanudatta', 'bhanudatta', 'Other', 854, 'भानुदत्त', 'भानुदत्त', 'भानुदत्त', 'भानुदत्त', 'Contents Page', 70, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', ''),
(897, '', '', '897', '', 723, '', '', '', '', 'GallerySub', 50, 'no', '2018-09-04', '897.jpg', '', '', '', '', '', '', '', ''),
(898, 'Ananda chapagain', 'Ananda Chapagai', 'ananda-chapagain', 'Header', 0, '', '', '', '', 'Normal Group', 120, 'no', '2018-09-06', '', 'normal', 'No', '', '', '', '', '', ''),
(896, 'Online Khabar', 'Online Khabar', 'online-khabar', 'Header', 847, '', '', 'http://onlinekhabar.com', '', 'Link', 70, 'no', '2018-09-04', '', 'normal', 'No', '', '', '', '', '', ''),
(863, 'Photo Gallery', 'Photo Gallery', 'photo-gallery', 'Other', 0, '', '', '', '', 'Gallery', 190, 'no', '2018-01-04', 'received_483922582092093.jpeg', 'normal', 'No', '', '', 'Hamrosanskar', '', '', ''),
(582, 'Video', 'Video', 'video', 'Other', 0, '', '', 'https://www.youtube.com/embed/h5YCbLUcpLs', '', 'Link', 160, 'no', '2017-03-08', '', 'normal', 'No', '', '', '', '', '', ''),
(854, 'Samaj Team Members', 'Samaj Team Members', 'samaj-team-members', 'Other', 0, '', '', '', '', 'Normal Group', 180, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(855, 'शिवनारायण', 'शिवनारायण', 'shiwanarayan', 'Other', 854, 'नाम: शिवनारायण', 'नाम: शिवनारायण', 'नाम: शिवनारायण', 'नाम: शिवनारायण', 'Contents Page', 10, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', ''),
(856, 'अन्शुरम', 'Ansuram', 'ansuram', 'Other', 854, 'नाम : अन्शुरम', 'नाम : अन्शुरम', 'नाम : अन्शुरम', 'नाम : अन्शुरम', 'Contents Page', 20, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', ''),
(857, 'धुर्वनारायण', 'Dhurwanarayan', 'dhurwanarayan', 'Other', 854, 'नाम :धुर्वनारायण', 'नाम :धुर्वनारायण', 'नाम :धुर्वनारायण', 'नाम :धुर्वनारायण', 'Contents Page', 30, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', ''),
(858, 'ज्ञानदास', 'Gyandas', 'dyandas', 'Other', 854, 'ज्ञानदास', 'ज्ञानदास', 'ज्ञानदास', 'ज्ञानदास', 'Contents Page', 40, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', ''),
(859, 'सत्यदेभ', 'सत्यदेभ', 'satyadev', 'Other', 854, 'सत्यदेभ', 'सत्यदेभ', 'सत्यदेभ', 'सत्यदेभ', 'Contents Page', 50, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', '');
INSERT INTO `groups` (`id`, `name`, `nameen`, `urlname`, `type`, `parentId`, `shortcontents`, `shortcontentsen`, `contents`, `contentsen`, `linkType`, `weight`, `hide`, `onDate`, `image`, `display`, `featured`, `block`, `transportation`, `pageTitle`, `pageKeyword`, `activity`, `publish`) VALUES
(338, 'हाम्रो बारेमा', 'About Us', 'about-us', 'Header', 0, '', '', 'चापागाईहरू महर्षि अत्रि र माता अनुसूयाका सन्तानहुन । ब्रह्माका मानसपुत्र अत्रि सप्तर्षि मध्यका एक हुन । महर्षी अत्रिको उतपत्ति श्वेतमनमन्तर कालमा भयेको धियो । जहाँ वैवश्वत मन्वन्तर कालमा पनि सप्तर्षिका रूपमा महर्षि अत्रि रहेका छन । ब्रम्हाजीले सृष्टिको आग्रह गर्दा सप्तर्षिको उतपत्ति भयो र महर्षि अत्रि ब्रह्माका चक्षुस्वरूप स्थिर भये । त्यसकारण महर्षि अत्रिलाई ग्यानका स्वरूप मानिन्छ । महर्षि अत्रि प्रजापति पनि हुन । अत्रि स्मृति ग्रन्थ, अत्रि संहिता, आचार संहिता, वेदान्त शास्त्र, केहि वैदिक मत्रं अत्रिका कृति रचना हुन । ऋगवेदका पाँचौं मण्डलका द्रष्टा र रामायणकालका पुरुषोत्तम भगवान श्रीरामचन्द्र जगत पिता महर्षी अत्रिको चित्रकुट आश्रम दर्शन गरि धन्य भयेको उल्लेख ग्रन्थमा माईन्छ । चित्रकुट वनमा कर्दन ऋषिकी पुत्री माता अनुसूयाले माता सीताजीलाई पतिव्रता धर्मको शिक्षा दिएकी थिइन । सीता साध्वीका रूपमा माता आनुसूया श्रेष्ठ छन ।&nbsp;<br />\r\nब्रह्माजीको आग्रह थियो महर्षी र ऋषि पत्नि अनुसूयाबाट सन्तानहरूको जन्म होस । महर्षी अत्रि र अनुसूया बिना तपस्या सन्तान सृष्टि नगर्ने भये र तपस्या गर्नलागे । यो तपस्यामा ब्रह्मा विष्णु र महेश्वर खुशी भयेर ब्रह्मा स्वभावले सोम (चन्द्रमा), विष्णु स्वभावले आत्रेय (दत्तात्रय) र महेश्वर स्वभावले महामुनी दुर्वासा ऋषि अत्रि र अनुसूयाका पुत्रका रूपमा जन्मलिए । महर्षि अत्रिको प्राचीन इतिहास &#39;अजरबैजान राज्यमा&#39; अझै पाईन्छ भनिन्छ । सर्वप्रथम वस्त्रपहिरणको सुरू हाम्रा जगत पिता महर्षी अत्रि र जगतमाता अनुसूयाले गरेका थिए भन्ने कुरा रामायनले उल्लेख गरेको छ ।<br />\r\nभारतवर्षका प्राचीन राजवंश अत्रि सोम वा चन्द्रवंशकै थिए । अत्रिवंशका राजा पुरुखा, बुध, नहुष, ययाती, मल्ल आदि हुन । द्वापरका भगवान कृष्ण चद्रवंशी हुन । पाण्डव वंश, यदुवंश, पांचालवंश सबै चन्द्रवंशकै मानिन्छन ।&nbsp;<br />\r\nकालान्तरमा लव, कुशका वशंधरहरूले उत्तरी भारत देखी पाकिस्तान र अफगानिस्तानसम्म आफ्नो राज्य विस्तार गरे । यसरी कुनै राज्य पतन भये र कुनै अन्यवंशोद्भवको राज्य स्थापन भयो । पछि यी राथज्यहरू खस, किराँत र मल्लहरू द्वारा शासित थिए । यी राज्यहरू सबैमा हिन्दुधर्मको प्रभाव पर्नाले कान्यकुब्जी हिन्दु ब्राह्मणहरू तल समतलमा हिन्दुब्राह्मणहरू माथी चलेको यवनहरूको दमनले यी हिन्दुब्राह्मणहरू गढवाल, कुमाउ र नेपालको पहाडीक्षेत्रमा धर्मसुरक्षा खोजेर खस, किराँतहरूसँग मिलेर बस्नलागे । यी राज्यहरूमा हिन्दुधर्म नै मुख्य हुनाले ब्राह्मणहरू सत्कारीत भये र शिक्षित र विद्वान समुहका रूपमा चिनिए । हिन्दु संस्कार भयेका यी राज्यका राजाहरूलाई पनि ब्राह्मणको खाँचो भयो र ब्राह्मणहरू अन्यत्र जानथाले ।&nbsp;<br />\r\nवैदिक आर्यहरूको प्राचीन थलो सिन्धु नदिको वारी पारीको भूभाग हो । महर्षी अत्रिको पनि यहि सप्तसिन्धू (पंजाब प्रदेश) कै भूभाग मूल थलो थियो । प्राचीन पुराणादि ग्रन्थमा उल्लेख गरेका राज्यहरू गंगाजी, यमुना, ब्रह्मपुत्र आदि नद नदिका छेउछाउ स्थापित थिए जुन आर्य संस्कारित थिए । अत्रिवंशोद्भव आजका क्षत्रियहरू पनि ब्राह्मण कै शाखा सन्तति हुन ।&nbsp;<br />\r\nमहर्षी अत्रिका वंश चापागाईका पुर्वपुरुष खोजि गर्दा चापागाईका सगोत्रीहरूको थर उल्लेख नगरि हुँदैन । यी सगोत्रीहरूहुन - गोतामे, खतिवडा, राउत, ओझा, मिश्र, विष्ठ, अवस्थि, पाहारी, पाठक, ठाडाराई अधिकारी, डांगी, खँडका, भूल, मल्ल, सिर्ध, जोशी, शाही, वर्मा, रावल, डोटेल र कडरीया ।<br />\r\nनानामुनि नाना मत भनेजस्तो माथी लेखिएका थरीहरूसंग चापागाईहरूको शाखा छुट्टिएको स्पष्ट मत कहि भेटिएको छैन । यी थरीहरूसंग चापागाईहरूको शरीर रूप-वर्णको चर्चा नै गर्दा पनि कुनै ठोस कुरा उल्लेख गर्न सकिन्न । खतिवडा, मल्ल, गोतामे, शाही थरीहरूसंग चापागाईहरूको प्रकृति केहि मिल्दोजुल्दो देखिएता पनि को कस्का पूर्वहुन भन्नेकुरा ठम्म्याउन सकिएको छैन । विभिन्न जनाले चापागाईँका पूर्वपुरुषको नाम भिन्ना भिन्नै उल्लेख गरेको पाईन्छ । आजको प्रामाणिक तथ्य मुताविक नेपाल भूभागका चापागाईहरू सप्तसिन्धुका डोटी राज्यमा जाने कनौज ब्राह्मणहरूका वंशोद्भव हुन ।&nbsp;<br />\r\nअत्रिवंश चापागाई वंशावली निर्माताहरूको अभिमत के छ भने - स्यांजाका जग्गनाथ&nbsp;चापागांई ले लेखेको बृहत् अत्रिगोत्रीय वंशावलीमा, गैंडाकोटका डोलराज चापागाईंको चापागाईं वंशावली र विश्वनाथ चापागाईंले दिंलाली चापागाईंको चापागाईं वंश गीतामा कनौजी ब्राह्मणका चार भाई मास्कर, प्रभास्कर, लल्ल र विल्ल थिए भन्नेकुरामा सहमत राखेको देखिन्छ । यी चार भाईका सन्तानहरूमा लल्लकका सन्तान अत्रि गोत्रीय हुन भनिएको छ ।&nbsp;<br />\r\nअझ भन्नु पर्दा योगी नरहरीनाथ, मिश्र, खतिवडा, कडरीया र बृहत् अत्रि गोत्रीय वंशावलीले लल्लका सन्तान चापागाईहरू हुन भन्ने प्रष्ट मत पोषण गरेका छन ।&nbsp;<br />\r\nदिंलाली चापागाई डा. नरेन्द्रराज चापागाईले चापागाई थर कसरी रह्यो भन्ने सम्वन्धमा भरपर्दो कुरो राखेका छन । थरहरू विशेषत राज सम्पर्क र ठाँउबाट आएका छन भन्ने उनको विचार नकार्न सकिन्न । उनको विचारमा हिमालवारी र हिमाल पारि तिब्बतको कतिअंश नागराज हिउजिउका वंश चाप राजेले दिएको विर्ता पाउने चापग्रामवासीहरू चापागाई कहलाईए ।<br />\r\nस्यांजाको चापागाँउ, काठमाण्डुको चापागाउ, राजस्थानको चापागाउँ, दैलेख, जुम्ला, आछाम, रुकुम र लाभु आदिका चाप जोडिएका गाँउहरू पनि धेरै तर्कमा राखेको पाइन्छ । (नेपालका केहि ठाँउहरूको अवस्थान- पाटन - ललितपुर, सिन्धुपाल्चोक- वागमति अन्चल, डोटी-सिलगढी सेती अंचल)<br />\r\nयहाँ आएर म के भन्न चाहन्छु भने उत्तर भारतका संस्कारीत कनौज ब्राह्मणहरू हिन्दु धर्मी प्राचीन आर्य र किराँत सँग मिलेर बसेका थिए । यीनै ब्राह्मणहरूका एक सन्तान विद्यवासिनी भगवती (उत्तर प्रदेश)को पूजा आराधना गरि बसे र उनका सन्तान बाट फैलिएको वंश नै यत्रतत्र छरिएर बसेका आजका चापागाईहरू हुन ।<br />\r\nकाश्यप, अत्रि, भरद्वाज, गौतम, विश्वामित्र, जमदग्नि र वशिष्ठ ऋषि आदि हिमालय खण्डमै सृष्टि भयेका र आर्यवर्तका अनेक ठाँउमा तपस्या गरि प्रतापी भयेका अष्ठासी हजार यी ऋषिहरूले मरुत आदि राजाहरूका यग्य-यग्यादि गराएका थिए । पं. पदमप्रसाद उपाध्यायले यसो भनेकाछन &quot;जम्बुद्वीपको उत्तरी भेक देखि नेपालका पशुपति, गुज्येश्वरी देवालय र काली गण्डकी, वागमती किनारमा राम्रो हवापानीका कारण तपस्या गर्दै आएका ऋषि मुनिका सन्तति यत्रतत्र छरिए । कालक्रममा यी कान्यकुब्जी ब्राह्मणहरू पाटन, भादगाँउ, गोर्खा इत्यादि ठाँउमा किरात नेवार क्षत्रियहरूका घरमा कर्मकाण्ड, यग्यादि गराउन लागे ।&quot;&nbsp;<br />\r\nदक्षिणी ब्राह्मणहरू पनि हिमालय क्षेत्रबाटै गयेका हुन । नदिहरूका बिचमा बसेका यिनका सन्ततिहरू अन्तर्वर्ती या कनौजी भये र पारि या सरयु र मथुरा तिर बस्ने सन्ततिहरू दक्षिणी वा गौड ब्राह्मण भये । त्यसरी नै पश्चिम मा बस्ने पश्चिमा ब्राह्मण र पूर्वी भेकमा बस्ने पूर्वेली ब्राह्मण भनेर चिनिए ।&nbsp;<br />\r\nनेपाली थर वंशावलीमा धेरैले कुशभद्र र उदयभद्र(लव)लाई आफ्ना प्राचीन पूर्वपुरुष मानेको पाइन्छ । वंशावलीको प्राचीन इतिहास खोज्नु भनेको सजिलो होइन । यी कुराहरू प्रति ध्यान राखेर वंशावलीका निर्माताहरूले चापागाई वंशका सर्वप्रथम पुरुषका रुपमा श्रीधर चापागाईको नाम उल्लेख गरेका छन । यहिँ पनि स्पष्ट मत छैन नै भन्न सकिन्छ । बालकृष्ण पोख्रेलको कलममा के उल्लेख छ भने अभय मल्ल (वि.स. १७२०)को पतन पछि लक्ष्मीधर नामका ब्राह्मण खिदिम गये । खिदिममा उनी गोतामे भनेर चिनिए । तर उनी लाभुको चापागाँउबाट खिदिम गयेका हुनाले त्यसकुराले उनी आफुलाई गर्वबोध भयो । यहिँबाट उनका सन्ततिहरू आफुलाई चागाई कहनलागे भनेता पनि उनका छोरा श्रीधरले आफुलाई चापागाई भने र श्रीधरका सन्ततिहरू चापागाईहुन भन्ने पोख्रेलको विद्वतामा प्रकाश पाएको छ ।&nbsp;<br />\r\nचापागाई वंशावलीका सवै निर्माताहरूले श्रीधर नै चापागाई थरका प्रथम मानेको पाइन्छ । पर्वत देउपुरका परमानन्द चापागाईको सानो वंशावलीमा वि.स.१७४१ मा प्रताप मल्लले देउपुरको गैराथोक भन्नेठाउमा ल्याएका पूर्खाका सातौं सन्तान श्रीधर चापागाई उल्लेख गरेका छन । तर उनको वंशावली चापागाई भाइ मुठोमा उल्लेखित परमानन्दको आफ्नो वंश पुस्ता क्रममा विस. १७४० श्रीधर चापागाईलाई मात्र लिन सकिन्छ । किन भने श्रीधर का सातौं पुर्खा १७४० अघि छुटेको बुझिन्छ ।&nbsp;<br />\r\nयसरी यो सम्वद पनि त्यत्ति ग्रहणीय मान्न सकिन्न । दिंलाली चापागाईका पुर्वपुरुष सिन्धुपाल्चोक जिलाको दुवाचौर बाट आएका र सिन्धुपाल्चोकको महाकालमा रहेको शिलापत्र मुताविक वि.स. १७०० तिर श्रीधरका सन्तानहरूको बसोवास थियो । देउपुरका परमानन्दसंग र सिन्धुपाल्चोकको महाकालमा पाइएका ऐतिहासिक लेख समसामयीक फेला परेका छन । चापागाईहरूका वंशावलीमा पनि यहि समयलाई किटान गरि वंशावली तैयार गरेको देखिन्छ । श्रीधर चापागाईका सन्ततिको समयसाल १६००/१७०० सत्य सावित भयेको छ । यस सन्दर्भमा यो आलोचना अघिसार्न खोजे जुन कुराले श्रीधर चापागाईसम्मका चापागाई पुर्खाको नामावली संग्लो हुनेछ । लगभग वि.स. सत्रसय सम्मको चापागाईका एक सन्ततिका सन्तानहरूले आफ्ना पुर्ख्याका नामावली विशुद्ध राखेका छन । म आफु पनि यति भन्नसक्छु &quot;हाम्रा पुर्खा १७०० साल अघिपछिको समयमा सिन्धुपाल्चोकमा थिए । उनीहरूले गोकुल सम्मका नाममा तर्पण दिइ आएका थिए । गोकुल चापागाईको समयसाल १६०० भित्र देखिन्छ । यसरी सिन्धुपाल्चोक र पर्वतका चापागाईहरू संग अहिले जुन ऐतिहासीक तत्थ्य छ त्यो तत्थ्यले आजका नेपाल, भारतमा छरिएर बसेका चापागाईहरूको वंशावली निर्माणमा ठूलो सहयोग पुर्याएको छ ।&nbsp;<br />\r\nपरमानन्दको पर्वतेली चापागाईहरूको वंशावलीले श्रीधर पछिका सन्तान चन्द्रमा चापागाई नामका श्रीधरका एक सन्ततिलाई प्रताप मल्लले देउपुर लगेकाथिए भन्ने कुरा बुझ्न सकिन्छ । सिन्धुपाल्चोकमा चापागाईको आगमन पनि यहि समय हो ।&nbsp;<br />\r\nउक्त आलोचनाबाट के कौतुहल जाग्छ भने सिन्धुपाल्चोक र देउपुरका चापागाईहरूका श्रीधरसम्मका पुर्खाहरूको नाम कतिसम्म सँच्याउन र केलाउन सकेका छौं ? ती पुर्खाहरू कहाँबाट आएका थिए ?&nbsp;<br />\r\nवी.स. २०७४ को प्रारम्भमा चापागाई बन्धुको खोजि गरि म स्यांजा पुगेको थिएँ । स्यांजा बजारमा बन्धुको खोजि गरि म एकजना भाईको आतिथ्यमा पुगें । भाइको परिचय लिँदा उनले आफुहरूले आज पनि चपाई थर लेखि आएको कुरा सुनाए । यसरी यी कुराले स्यांजाका चापागाईहरूको पनि बसोवास ऐतिहासिक देखिन्छ । चपाई र चापागाई कुन अघिको हो भन्ने कुरा छुट्याउन सजिलो छैन । स्यांजाका जगन्नाथको वंशावलीमा पनि यस विषयमा विशेष कुरा उल्लेख भयेको छैन । यसै प्रसंगमा फेरि के भन्न चाहन्छु भने डा. खेमराजको पुस्तक अनुवाद गरि लोकनाथ चापागाईले के लेखेका छन भने - दार्जीलिंमा रहेका राईगाँउ, गुरुंगवस्ती, प्रधान नगर जस्ता नामहरू जात जातिको बसोवास बाटै सँष्टि भयेका हुन । त्यस्तै संखुवासभाको नाम आफ्नै प्रकारको छ । परापुर्वकालमा त्यहाँ ऋषिमुनिहरूको सभा बसेको हुनाले संखुवासभा नामरहेको भन्ने जनजनको भनाई छ । खाँदबारीमा चापागाईडाँडा भन्ने एउटा गाँउनै छ जँहा चापागाईहरूको बसोवासो थियो । तर यो चापागाई डाँडाको इतिहास सिन्धुपाल्चोकको दुवाचौरबाट आएका धर्मानन्द पाध्याका सन्तति हुन । यहाँसम्म जति चापागाईगाँउ बस्तीका नाम पाइएको छ यो पुरानो हो तर प्राचीन होइन ।&nbsp;<br />\r\nलोकनाथको अनुवाद.पुस्तकले अर्को केकुरा प्रष्ट पारेको छ भने &quot;नेपाल र सिक्कीम बिच भयेको युद्ध (1788 सन तदनुसार वि.स. १८४६?) र अंगरेजहरूसंगको भारत नेपाल सन्धि चुक्ति पछि आसामको सुनकोस देखि पंजाबको सतलजसम्मका भूभागको शासन परिवर्तनका कारण ती भूमिका बासिन्दा ईच्छानुसार आजको नेपाल र भारतका विभिन्न ठाँउमा सरुवा भै स्थायी भये ।&quot; जसरी नेपालबाट लिम्बुहरू दार्जीलिं पसे त्यस्तै चापागाईहरू भारतका विभिन्न ठाउँमा बसोवास गर्नलागे । आज नेपाल र भारतको सिक्कीम, पश्चिमबंगाल, आसाम एवं उत्तर पूर्वांचलका सबै राज्यमा जहाँ जे जति चापागाँईहरू छन सबै गोकुल चापागाईका सन्ततिका समसामयिक अन्य पुर्खाका सन्तान सन्तति हुन । उनीहरूसंगको आफ्नो पुर्ख्याउली इतिहास विक्रमसम्वद १७००-१८०० पछिको मात्रै छ ।<br />\r\nतर लोकनाथको पुस्तकमा एउटा घतलाग्दो कुरा के छ भने &quot;दार्जीलिंमा रहेको महाकाल मन्दिर महाकाल डाँडामा विशघर परिवार थिए (1876सन /विस १९३४मा स्थापना भैसकेको।&quot; यता नेपालको सिन्धुपाल्चोकको महाकाल विस १६००-१७००(स्थापनाकाल) को पनि अवस्था त्यस्तै थियो । यी दुई स्थानको दुरत्व र दुर्गमता हुँदाहुँदै एकै देवनाम र जाति एवं एकै पहाडी भौगोलिक स्थानमा देवालय र वस्ती बस्नुले पनि धेरै कुराको संकेत गरेको छ ।&nbsp;<br />\r\nउफरोक्त विषय जे नै भयेता पनि चापागाईहरूका केहि वंशावली बनिएका छन । यी वंशावलीमा आफुहरूले आआफ्नो वंशलता यस प्रकार देखाएका छन -&nbsp;<br />\r\n1) देउपुरका परमानन्द&nbsp;<br />\r\nचन्द्रमा अंशुराम दुर्योधन वाचस्पति कपिलदेव धर्मदेव श्रीधर ध्रुवलाल अंशुराम वाचस्पति श्रीहर्क जोखुराम नाथुराम परमानन्द अनन्त सेउराम कन्चन भवदत्त परमानन्द ।<br />\r\n2) जगन्नाथको वंशावली<br />\r\nअग्निदेव वषिष्टभट्ट कमलापति काशिदास जयनारायण अमरदेव काशिदास लल्लक गोतमदास हरिदास ग्यानदास देवीलाल चामुपाध्या सिद्धुपाध्या बालानन्द लोचनदेव कामदेव देविप्रसाद जगन्नाथ ।<br />\r\n3) डोलराजको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधर विष्णुदत्त पूष्पनिधि धनपति हरिनारायण विश्वामित्र गोविन्द श्रीकृष्ण माधव सुन्दर बालाकृष्ण हरिदास देवदत्त शिवनारायण किसानदास माधव सन्तदेव वंशमुनि हरिनारायण बालाकृष्ण बिद्धु हरिलाल दिवाखर डोलराज ।<br />\r\n4) विश्वनाथको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधरका सन्तति दैलेख स्यांजाबाट सिन्धुपाल्चोक नैनानन्द देवनारायण नारायणपाध्या धनपति लक्ष्मीप्रसाद गिरीराज कालिका विश्वनाथ ।&nbsp;<br />\r\n5) लेखकको आफ्नो&nbsp;<br />\r\nसैगुण सन्तति श्रीधरका एक सन्तति ध्रुवनारायण का सन्तान गोकुल नैनान्द देवनारायण नारायणपाध्या धर्मानन्द डिल्लीकेशर काशिनाथ ग्यानप्रसाद योगप्रसाद(लेखक) ।', 'चापागाईहरू महर्षि अत्रि र माता अनुसूयाका सन्तानहुन । ब्रह्माका मानसपुत्र अत्रि सप्तर्षि मध्यका एक हुन । महर्षी अत्रिको उतपत्ति श्वेतमनमन्तर कालमा भयेको धियो । जहाँ वैवश्वत मन्वन्तर कालमा पनि सप्तर्षिका रूपमा महर्षि अत्रि रहेका छन । ब्रम्हाजीले सृष्टिको आग्रह गर्दा सप्तर्षिको उतपत्ति भयो र महर्षि अत्रि ब्रह्माका चक्षुस्वरूप स्थिर भये । त्यसकारण महर्षि अत्रिलाई ग्यानका स्वरूप मानिन्छ । महर्षि अत्रि प्रजापति पनि हुन । अत्रि स्मृति ग्रन्थ, अत्रि संहिता, आचार संहिता, वेदान्त शास्त्र, केहि वैदिक मत्रं अत्रिका कृति रचना हुन । ऋगवेदका पाँचौं मण्डलका द्रष्टा र रामायणकालका पुरुषोत्तम भगवान श्रीरामचन्द्र जगत पिता महर्षी अत्रिको चित्रकुट आश्रम दर्शन गरि धन्य भयेको उल्लेख ग्रन्थमा माईन्छ । चित्रकुट वनमा कर्दन ऋषिकी पुत्री माता अनुसूयाले माता सीताजीलाई पतिव्रता धर्मको शिक्षा दिएकी थिइन । सीता साध्वीका रूपमा माता आनुसूया श्रेष्ठ छन ।&nbsp;<br />\r\nब्रह्माजीको आग्रह थियो महर्षी र ऋषि पत्नि अनुसूयाबाट सन्तानहरूको जन्म होस । महर्षी अत्रि र अनुसूया बिना तपस्या सन्तान सृष्टि नगर्ने भये र तपस्या गर्नलागे । यो तपस्यामा ब्रह्मा विष्णु र महेश्वर खुशी भयेर ब्रह्मा स्वभावले सोम (चन्द्रमा), विष्णु स्वभावले आत्रेय (दत्तात्रय) र महेश्वर स्वभावले महामुनी दुर्वासा ऋषि अत्रि र अनुसूयाका पुत्रका रूपमा जन्मलिए । महर्षि अत्रिको प्राचीन इतिहास &#39;अजरबैजान राज्यमा&#39; अझै पाईन्छ भनिन्छ । सर्वप्रथम वस्त्रपहिरणको सुरू हाम्रा जगत पिता महर्षी अत्रि र जगतमाता अनुसूयाले गरेका थिए भन्ने कुरा रामायनले उल्लेख गरेको छ ।<br />\r\nभारतवर्षका प्राचीन राजवंश अत्रि सोम वा चन्द्रवंशकै थिए । अत्रिवंशका राजा पुरुखा, बुध, नहुष, ययाती, मल्ल आदि हुन । द्वापरका भगवान कृष्ण चद्रवंशी हुन । पाण्डव वंश, यदुवंश, पांचालवंश सबै चन्द्रवंशकै मानिन्छन ।&nbsp;<br />\r\nकालान्तरमा लव, कुशका वशंधरहरूले उत्तरी भारत देखी पाकिस्तान र अफगानिस्तानसम्म आफ्नो राज्य विस्तार गरे । यसरी कुनै राज्य पतन भये र कुनै अन्यवंशोद्भवको राज्य स्थापन भयो । पछि यी राथज्यहरू खस, किराँत र मल्लहरू द्वारा शासित थिए । यी राज्यहरू सबैमा हिन्दुधर्मको प्रभाव पर्नाले कान्यकुब्जी हिन्दु ब्राह्मणहरू तल समतलमा हिन्दुब्राह्मणहरू माथी चलेको यवनहरूको दमनले यी हिन्दुब्राह्मणहरू गढवाल, कुमाउ र नेपालको पहाडीक्षेत्रमा धर्मसुरक्षा खोजेर खस, किराँतहरूसँग मिलेर बस्नलागे । यी राज्यहरूमा हिन्दुधर्म नै मुख्य हुनाले ब्राह्मणहरू सत्कारीत भये र शिक्षित र विद्वान समुहका रूपमा चिनिए । हिन्दु संस्कार भयेका यी राज्यका राजाहरूलाई पनि ब्राह्मणको खाँचो भयो र ब्राह्मणहरू अन्यत्र जानथाले ।&nbsp;<br />\r\nवैदिक आर्यहरूको प्राचीन थलो सिन्धु नदिको वारी पारीको भूभाग हो । महर्षी अत्रिको पनि यहि सप्तसिन्धू (पंजाब प्रदेश) कै भूभाग मूल थलो थियो । प्राचीन पुराणादि ग्रन्थमा उल्लेख गरेका राज्यहरू गंगाजी, यमुना, ब्रह्मपुत्र आदि नद नदिका छेउछाउ स्थापित थिए जुन आर्य संस्कारित थिए । अत्रिवंशोद्भव आजका क्षत्रियहरू पनि ब्राह्मण कै शाखा सन्तति हुन ।&nbsp;<br />\r\nमहर्षी अत्रिका वंश चापागाईका पुर्वपुरुष खोजि गर्दा चापागाईका सगोत्रीहरूको थर उल्लेख नगरि हुँदैन । यी सगोत्रीहरूहुन - गोतामे, खतिवडा, राउत, ओझा, मिश्र, विष्ठ, अवस्थि, पाहारी, पाठक, ठाडाराई अधिकारी, डांगी, खँडका, भूल, मल्ल, सिर्ध, जोशी, शाही, वर्मा, रावल, डोटेल र कडरीया ।<br />\r\nनानामुनि नाना मत भनेजस्तो माथी लेखिएका थरीहरूसंग चापागाईहरूको शाखा छुट्टिएको स्पष्ट मत कहि भेटिएको छैन । यी थरीहरूसंग चापागाईहरूको शरीर रूप-वर्णको चर्चा नै गर्दा पनि कुनै ठोस कुरा उल्लेख गर्न सकिन्न । खतिवडा, मल्ल, गोतामे, शाही थरीहरूसंग चापागाईहरूको प्रकृति केहि मिल्दोजुल्दो देखिएता पनि को कस्का पूर्वहुन भन्नेकुरा ठम्म्याउन सकिएको छैन । विभिन्न जनाले चापागाईँका पूर्वपुरुषको नाम भिन्ना भिन्नै उल्लेख गरेको पाईन्छ । आजको प्रामाणिक तथ्य मुताविक नेपाल भूभागका चापागाईहरू सप्तसिन्धुका डोटी राज्यमा जाने कनौज ब्राह्मणहरूका वंशोद्भव हुन ।&nbsp;<br />\r\nअत्रिवंश चापागाई वंशावली निर्माताहरूको अभिमत के छ भने - स्यांजाका जग्गनाथ&nbsp;चापागांई ले लेखेको बृहत् अत्रिगोत्रीय वंशावलीमा, गैंडाकोटका डोलराज चापागाईंको चापागाईं वंशावली र विश्वनाथ चापागाईंले दिंलाली चापागाईंको चापागाईं वंश गीतामा कनौजी ब्राह्मणका चार भाई मास्कर, प्रभास्कर, लल्ल र विल्ल थिए भन्नेकुरामा सहमत राखेको देखिन्छ । यी चार भाईका सन्तानहरूमा लल्लकका सन्तान अत्रि गोत्रीय हुन भनिएको छ ।&nbsp;<br />\r\nअझ भन्नु पर्दा योगी नरहरीनाथ, मिश्र, खतिवडा, कडरीया र बृहत् अत्रि गोत्रीय वंशावलीले लल्लका सन्तान चापागाईहरू हुन भन्ने प्रष्ट मत पोषण गरेका छन ।&nbsp;<br />\r\nदिंलाली चापागाई डा. नरेन्द्रराज चापागाईले चापागाई थर कसरी रह्यो भन्ने सम्वन्धमा भरपर्दो कुरो राखेका छन । थरहरू विशेषत राज सम्पर्क र ठाँउबाट आएका छन भन्ने उनको विचार नकार्न सकिन्न । उनको विचारमा हिमालवारी र हिमाल पारि तिब्बतको कतिअंश नागराज हिउजिउका वंश चाप राजेले दिएको विर्ता पाउने चापग्रामवासीहरू चापागाई कहलाईए ।<br />\r\nस्यांजाको चापागाँउ, काठमाण्डुको चापागाउ, राजस्थानको चापागाउँ, दैलेख, जुम्ला, आछाम, रुकुम र लाभु आदिका चाप जोडिएका गाँउहरू पनि धेरै तर्कमा राखेको पाइन्छ । (नेपालका केहि ठाँउहरूको अवस्थान- पाटन - ललितपुर, सिन्धुपाल्चोक- वागमति अन्चल, डोटी-सिलगढी सेती अंचल)<br />\r\nयहाँ आएर म के भन्न चाहन्छु भने उत्तर भारतका संस्कारीत कनौज ब्राह्मणहरू हिन्दु धर्मी प्राचीन आर्य र किराँत सँग मिलेर बसेका थिए । यीनै ब्राह्मणहरूका एक सन्तान विद्यवासिनी भगवती (उत्तर प्रदेश)को पूजा आराधना गरि बसे र उनका सन्तान बाट फैलिएको वंश नै यत्रतत्र छरिएर बसेका आजका चापागाईहरू हुन ।<br />\r\nकाश्यप, अत्रि, भरद्वाज, गौतम, विश्वामित्र, जमदग्नि र वशिष्ठ ऋषि आदि हिमालय खण्डमै सृष्टि भयेका र आर्यवर्तका अनेक ठाँउमा तपस्या गरि प्रतापी भयेका अष्ठासी हजार यी ऋषिहरूले मरुत आदि राजाहरूका यग्य-यग्यादि गराएका थिए । पं. पदमप्रसाद उपाध्यायले यसो भनेकाछन &quot;जम्बुद्वीपको उत्तरी भेक देखि नेपालका पशुपति, गुज्येश्वरी देवालय र काली गण्डकी, वागमती किनारमा राम्रो हवापानीका कारण तपस्या गर्दै आएका ऋषि मुनिका सन्तति यत्रतत्र छरिए । कालक्रममा यी कान्यकुब्जी ब्राह्मणहरू पाटन, भादगाँउ, गोर्खा इत्यादि ठाँउमा किरात नेवार क्षत्रियहरूका घरमा कर्मकाण्ड, यग्यादि गराउन लागे ।&quot;&nbsp;<br />\r\nदक्षिणी ब्राह्मणहरू पनि हिमालय क्षेत्रबाटै गयेका हुन । नदिहरूका बिचमा बसेका यिनका सन्ततिहरू अन्तर्वर्ती या कनौजी भये र पारि या सरयु र मथुरा तिर बस्ने सन्ततिहरू दक्षिणी वा गौड ब्राह्मण भये । त्यसरी नै पश्चिम मा बस्ने पश्चिमा ब्राह्मण र पूर्वी भेकमा बस्ने पूर्वेली ब्राह्मण भनेर चिनिए ।&nbsp;<br />\r\nनेपाली थर वंशावलीमा धेरैले कुशभद्र र उदयभद्र(लव)लाई आफ्ना प्राचीन पूर्वपुरुष मानेको पाइन्छ । वंशावलीको प्राचीन इतिहास खोज्नु भनेको सजिलो होइन । यी कुराहरू प्रति ध्यान राखेर वंशावलीका निर्माताहरूले चापागाई वंशका सर्वप्रथम पुरुषका रुपमा श्रीधर चापागाईको नाम उल्लेख गरेका छन । यहिँ पनि स्पष्ट मत छैन नै भन्न सकिन्छ । बालकृष्ण पोख्रेलको कलममा के उल्लेख छ भने अभय मल्ल (वि.स. १७२०)को पतन पछि लक्ष्मीधर नामका ब्राह्मण खिदिम गये । खिदिममा उनी गोतामे भनेर चिनिए । तर उनी लाभुको चापागाँउबाट खिदिम गयेका हुनाले त्यसकुराले उनी आफुलाई गर्वबोध भयो । यहिँबाट उनका सन्ततिहरू आफुलाई चागाई कहनलागे भनेता पनि उनका छोरा श्रीधरले आफुलाई चापागाई भने र श्रीधरका सन्ततिहरू चापागाईहुन भन्ने पोख्रेलको विद्वतामा प्रकाश पाएको छ ।&nbsp;<br />\r\nचापागाई वंशावलीका सवै निर्माताहरूले श्रीधर नै चापागाई थरका प्रथम मानेको पाइन्छ । पर्वत देउपुरका परमानन्द चापागाईको सानो वंशावलीमा वि.स.१७४१ मा प्रताप मल्लले देउपुरको गैराथोक भन्नेठाउमा ल्याएका पूर्खाका सातौं सन्तान श्रीधर चापागाई उल्लेख गरेका छन । तर उनको वंशावली चापागाई भाइ मुठोमा उल्लेखित परमानन्दको आफ्नो वंश पुस्ता क्रममा विस. १७४० श्रीधर चापागाईलाई मात्र लिन सकिन्छ । किन भने श्रीधर का सातौं पुर्खा १७४० अघि छुटेको बुझिन्छ ।&nbsp;<br />\r\nयसरी यो सम्वद पनि त्यत्ति ग्रहणीय मान्न सकिन्न । दिंलाली चापागाईका पुर्वपुरुष सिन्धुपाल्चोक जिलाको दुवाचौर बाट आएका र सिन्धुपाल्चोकको महाकालमा रहेको शिलापत्र मुताविक वि.स. १७०० तिर श्रीधरका सन्तानहरूको बसोवास थियो । देउपुरका परमानन्दसंग र सिन्धुपाल्चोकको महाकालमा पाइएका ऐतिहासिक लेख समसामयीक फेला परेका छन । चापागाईहरूका वंशावलीमा पनि यहि समयलाई किटान गरि वंशावली तैयार गरेको देखिन्छ । श्रीधर चापागाईका सन्ततिको समयसाल १६००/१७०० सत्य सावित भयेको छ । यस सन्दर्भमा यो आलोचना अघिसार्न खोजे जुन कुराले श्रीधर चापागाईसम्मका चापागाई पुर्खाको नामावली संग्लो हुनेछ । लगभग वि.स. सत्रसय सम्मको चापागाईका एक सन्ततिका सन्तानहरूले आफ्ना पुर्ख्याका नामावली विशुद्ध राखेका छन । म आफु पनि यति भन्नसक्छु &quot;हाम्रा पुर्खा १७०० साल अघिपछिको समयमा सिन्धुपाल्चोकमा थिए । उनीहरूले गोकुल सम्मका नाममा तर्पण दिइ आएका थिए । गोकुल चापागाईको समयसाल १६०० भित्र देखिन्छ । यसरी सिन्धुपाल्चोक र पर्वतका चापागाईहरू संग अहिले जुन ऐतिहासीक तत्थ्य छ त्यो तत्थ्यले आजका नेपाल, भारतमा छरिएर बसेका चापागाईहरूको वंशावली निर्माणमा ठूलो सहयोग पुर्याएको छ ।&nbsp;<br />\r\nपरमानन्दको पर्वतेली चापागाईहरूको वंशावलीले श्रीधर पछिका सन्तान चन्द्रमा चापागाई नामका श्रीधरका एक सन्ततिलाई प्रताप मल्लले देउपुर लगेकाथिए भन्ने कुरा बुझ्न सकिन्छ । सिन्धुपाल्चोकमा चापागाईको आगमन पनि यहि समय हो ।&nbsp;<br />\r\nउक्त आलोचनाबाट के कौतुहल जाग्छ भने सिन्धुपाल्चोक र देउपुरका चापागाईहरूका श्रीधरसम्मका पुर्खाहरूको नाम कतिसम्म सँच्याउन र केलाउन सकेका छौं ? ती पुर्खाहरू कहाँबाट आएका थिए ?&nbsp;<br />\r\nवी.स. २०७४ को प्रारम्भमा चापागाई बन्धुको खोजि गरि म स्यांजा पुगेको थिएँ । स्यांजा बजारमा बन्धुको खोजि गरि म एकजना भाईको आतिथ्यमा पुगें । भाइको परिचय लिँदा उनले आफुहरूले आज पनि चपाई थर लेखि आएको कुरा सुनाए । यसरी यी कुराले स्यांजाका चापागाईहरूको पनि बसोवास ऐतिहासिक देखिन्छ । चपाई र चापागाई कुन अघिको हो भन्ने कुरा छुट्याउन सजिलो छैन । स्यांजाका जगन्नाथको वंशावलीमा पनि यस विषयमा विशेष कुरा उल्लेख भयेको छैन । यसै प्रसंगमा फेरि के भन्न चाहन्छु भने डा. खेमराजको पुस्तक अनुवाद गरि लोकनाथ चापागाईले के लेखेका छन भने - दार्जीलिंमा रहेका राईगाँउ, गुरुंगवस्ती, प्रधान नगर जस्ता नामहरू जात जातिको बसोवास बाटै सँष्टि भयेका हुन । त्यस्तै संखुवासभाको नाम आफ्नै प्रकारको छ । परापुर्वकालमा त्यहाँ ऋषिमुनिहरूको सभा बसेको हुनाले संखुवासभा नामरहेको भन्ने जनजनको भनाई छ । खाँदबारीमा चापागाईडाँडा भन्ने एउटा गाँउनै छ जँहा चापागाईहरूको बसोवासो थियो । तर यो चापागाई डाँडाको इतिहास सिन्धुपाल्चोकको दुवाचौरबाट आएका धर्मानन्द पाध्याका सन्तति हुन । यहाँसम्म जति चापागाईगाँउ बस्तीका नाम पाइएको छ यो पुरानो हो तर प्राचीन होइन ।&nbsp;<br />\r\nलोकनाथको अनुवाद.पुस्तकले अर्को केकुरा प्रष्ट पारेको छ भने &quot;नेपाल र सिक्कीम बिच भयेको युद्ध (1788 सन तदनुसार वि.स. १८४६?) र अंगरेजहरूसंगको भारत नेपाल सन्धि चुक्ति पछि आसामको सुनकोस देखि पंजाबको सतलजसम्मका भूभागको शासन परिवर्तनका कारण ती भूमिका बासिन्दा ईच्छानुसार आजको नेपाल र भारतका विभिन्न ठाँउमा सरुवा भै स्थायी भये ।&quot; जसरी नेपालबाट लिम्बुहरू दार्जीलिं पसे त्यस्तै चापागाईहरू भारतका विभिन्न ठाउँमा बसोवास गर्नलागे । आज नेपाल र भारतको सिक्कीम, पश्चिमबंगाल, आसाम एवं उत्तर पूर्वांचलका सबै राज्यमा जहाँ जे जति चापागाँईहरू छन सबै गोकुल चापागाईका सन्ततिका समसामयिक अन्य पुर्खाका सन्तान सन्तति हुन । उनीहरूसंगको आफ्नो पुर्ख्याउली इतिहास विक्रमसम्वद १७००-१८०० पछिको मात्रै छ ।<br />\r\nतर लोकनाथको पुस्तकमा एउटा घतलाग्दो कुरा के छ भने &quot;दार्जीलिंमा रहेको महाकाल मन्दिर महाकाल डाँडामा विशघर परिवार थिए (1876सन /विस १९३४मा स्थापना भैसकेको।&quot; यता नेपालको सिन्धुपाल्चोकको महाकाल विस १६००-१७००(स्थापनाकाल) को पनि अवस्था त्यस्तै थियो । यी दुई स्थानको दुरत्व र दुर्गमता हुँदाहुँदै एकै देवनाम र जाति एवं एकै पहाडी भौगोलिक स्थानमा देवालय र वस्ती बस्नुले पनि धेरै कुराको संकेत गरेको छ ।&nbsp;<br />\r\nउफरोक्त विषय जे नै भयेता पनि चापागाईहरूका केहि वंशावली बनिएका छन । यी वंशावलीमा आफुहरूले आआफ्नो वंशलता यस प्रकार देखाएका छन -&nbsp;<br />\r\n1) देउपुरका परमानन्द&nbsp;<br />\r\nचन्द्रमा अंशुराम दुर्योधन वाचस्पति कपिलदेव धर्मदेव श्रीधर ध्रुवलाल अंशुराम वाचस्पति श्रीहर्क जोखुराम नाथुराम परमानन्द अनन्त सेउराम कन्चन भवदत्त परमानन्द ।<br />\r\n2) जगन्नाथको वंशावली<br />\r\nअग्निदेव वषिष्टभट्ट कमलापति काशिदास जयनारायण अमरदेव काशिदास लल्लक गोतमदास हरिदास ग्यानदास देवीलाल चामुपाध्या सिद्धुपाध्या बालानन्द लोचनदेव कामदेव देविप्रसाद जगन्नाथ ।<br />\r\n3) डोलराजको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधर विष्णुदत्त पूष्पनिधि धनपति हरिनारायण विश्वामित्र गोविन्द श्रीकृष्ण माधव सुन्दर बालाकृष्ण हरिदास देवदत्त शिवनारायण किसानदास माधव सन्तदेव वंशमुनि हरिनारायण बालाकृष्ण बिद्धु हरिलाल दिवाखर डोलराज ।<br />\r\n4) विश्वनाथको वंशावली<br />\r\nसैगुणब्राह्मण लक्ष्मीधर श्रीधरका सन्तति दैलेख स्यांजाबाट सिन्धुपाल्चोक नैनानन्द देवनारायण नारायणपाध्या धनपति लक्ष्मीप्रसाद गिरीराज कालिका विश्वनाथ ।&nbsp;<br />\r\n5) लेखकको आफ्नो&nbsp;<br />\r\nसैगुण सन्तति श्रीधरका एक सन्तति ध्रुवनारायण का सन्तान गोकुल नैनान्द देवनारायण नारायणपाध्या धर्मानन्द डिल्लीकेशर काशिनाथ ग्यानप्रसाद योगप्रसाद(लेखक) ।', 'Normal Group', 20, 'no', '2015-04-07', '', 'normal', 'No', '', '', '', '', '', ''),
(868, 'Our Missions', 'Our Missions', 'our-missions', 'Header', 338, 'hamro chapagain samajko udeshya as prakar chha.', 'hamro chapagain samajko udeshya as prakar chha.', 'हाम्रो पत्रीक werwerrew', 'हाम्रो पत्रीकd &nbsp;efewrwerr', 'Contents Page', 10, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(869, 'Our Vision', 'Our Vision', 'our-vision', 'Header', 338, '', '', '', '', 'Contents Page', 20, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(870, 'Our Aims', 'Our Aims', 'our-aims', 'Header', 338, '', '', '', '', 'Contents Page', 30, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(373, '&#2349;&#2367;&#2337;&#2367;&#2351;&#2379;', 'Official-Video', 'youtube', 'Other', 0, '', '', 'https://www.youtube.com/embed/sw0jlvkH9KA', '', 'Link', 140, 'no', '2016-06-15', '', 'normal', 'No', '', '', '', '', '', ''),
(274, 'Message From Chief', 'Message From Chief', 'message-from-chief', 'Other', 0, 'सबै चापागाई वन्धुहरुमा स्वागत छ ।हामी महर्षि अत्रि र अनुसुया देवीका सन्तान अत्रि गोत्रीय चापागाईहरुको पुर्खाहरु को हुनुहुन्थ्यो भन्ने कुरा खोजी हुनु स्वाभाविक हो ।महर्षि अत्रि पछि करिव ८ दर्जन पुस्ता सम्म ऋषि मुनिहरु रहनु भएको हाम्रा पुर्खाहरुको बारेमा जानकारी राख्न र हामी चापागाईहरु वीच अझ नजिकको नाता कायम गर्न हाम्रो वंशँवली तयार गर्न आवश्यक महशुस गरिुएको छ। त्यसैले हामी आफ्नो पुर्खाको बारेमा जति पनि थाहा छ सो विवरण उपलव्ध गराएर यस कार्यलाई सबैले सहयोग गर्नु हुनेछ भन्ने विश्वास लिईएको छ ।', 'Vijnyan tatha prayukti vidyako yas yugma pashchatyako vikashle hamilai dheraikura sikayo. arthatantrako pragati sangai hami aadhunik yugaka vijnyanka upakaranharuko prayog garna niskiyw. hamra pitapurkhako adarsh ra prerana anukaran garna vijnyanko sahayog lina safalta prapta gareka chha', '<p style=\"text-align:justify\">&nbsp; &nbsp; &nbsp;</p>\r\n', '<p style=\"text-align:justify\">Vijnyan tatha prayukti vidyako yas yugma pashchatyako vikashle hamilai dheraikura sikayo. arthatantrako pragati sangai hami aadhunik yugaka vijnyanka upakaranharuko prayog garna niskiyw. hamra pitapurkhako adarsh ra prerana anukaran garna vijnyanko sahayog lina safalta prapta gareka chha. TU ka Adaraniya sirharu ko nyano maya pachhi Kathmandu Krishighar ko parishram le Atri vashodbhav Chapagainharu ko Chapagain Vanshavali web. taiyar gareko sandensh yahaharu samma puryauna pauda harsha lageko chha.&nbsp; Yo safalta hamisabaiko s</p>\r\n', 'Contents Page', 30, 'no', '2014-04-22', '', 'normal', 'No', '', '', '', '', '', ''),
(723, 'Slider', 'Slider', 'slider', 'Other', 0, '', '', '', '', 'Gallery', 170, 'no', '2017-04-03', '', 'normal', 'No', '', '', '', '', '', ''),
(847, 'Important Links', 'Important Links', 'important-links', 'Header', 0, 'Hello', '', 'hello', 'hello', 'Normal Group', 40, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(848, 'ICT in Agriculture Nepal', 'ICT in Agriculture Nepal', 'ict-in-agriculture-nepal', 'Header', 847, '', '', 'http://krishighar.com', '', 'Link', 10, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(624, 'सम्पर्क', 'Contact', 'contact-us', 'Header', 0, 'Yog Prasad Upadhyaya Chapagain<br />\r\n9805374337, +918812894954<br />\r\nईमेल ठेगाना : &nbsp;no email right now<br />\r\nबेव साईट :&nbsp;chapagainbanshawali.com', 'Yog Prasad Upadhyaya Chapagain<br />\r\n9805374337, +918812894954<br />\r\nईमेल ठेगाना : &nbsp;no email right now<br />\r\nबेव साईट :&nbsp;chapagainbanshawali.com', 'Yog Prasad Upadhyaya Chapagain<br />\r\n9805374337, +918812894954<br />\r\nईमेल ठेगाना : &nbsp;no email right now<br />\r\nबेव साईट :&nbsp;chapagainbanshawali.com\r\n<div style=\"display: none;\"><a href=\"http://www.o3interactive.net/\">porno gif</a> <a href=\"http://amcik.amressimleri.xyz/\">porno resimleri</a> <a href=\"http://www.amressimleri.xyz/seks-resimleri.html\">Seks Resimleri</a>- <a href=\"http://www.amressimleri.xyz/am-resimleri.html\">Am Resimleri</a>- <a href=\"http://www.amressimleri.xyz/meme-resimleri.html\">Meme Resimleri</a>- <a href=\"http://www.amressimleri.xyz/turbanli-resimleri.html\">Turbanli Resimleri</a> <a href=\"http://www.amressimleri.xyz/adult-resimleri.html\">Adult Resimleri</a>- <a href=\"http://www.grossbrusteporno.com/\">pornofilme</a>- <a href=\"http://virus.temizleme.org/\">cep telefonu virus temizleme</a>- <a href=\"http://virus.temizleme.org/telefonda-virus-oldugu-nasil-anlasilir/\">telefonda virus oldugu nasil anlasilir</a>- <a href=\"http://virus.temizleme.org/cep-telefonuna-virus-nasil-bulasir/\">telefona virus nasil bulasir</a>- <a href=\"http://virus.temizleme.org/cep-telefonuma-bulasan-virusleri-nasil-temizlerim/\">telefonuma bulasan virusleri nasil temizlerim</a>- <a href=\"http://virus.temizleme.org/telefon-virus-temizleme-programi/\">telefon virus temizleme programi</a>- <a href=\"http://virus.temizleme.org/telefonu-fabrika-ayarlarina-dondurme/\">telefonu fabrika ayarlarina dondurme</a>-</div>\r\n', 'Yog Prasad Upadhyaya Chapagain<br />\r\n9805374337, +918812894954<br />\r\nईमेल ठेगाना : &nbsp;no email right now<br />\r\nबेव साईट :&nbsp;chapagainbanshawali.com\r\n<div style=\"display: none;\"><a href=\"http://www.o3interactive.net/\">porno gif</a> <a href=\"http://amcik.amressimleri.xyz/\">porno resimleri</a> <a href=\"http://www.amressimleri.xyz/seks-resimleri.html\">Seks Resimleri</a>- <a href=\"http://www.amressimleri.xyz/am-resimleri.html\">Am Resimleri</a>- <a href=\"http://www.amressimleri.xyz/meme-resimleri.html\">Meme Resimleri</a>- <a href=\"http://www.amressimleri.xyz/turbanli-resimleri.html\">Turbanli Resimleri</a> <a href=\"http://www.amressimleri.xyz/adult-resimleri.html\">Adult Resimleri</a>- <a href=\"http://www.grossbrusteporno.com/\">pornofilme</a>- <a href=\"http://virus.temizleme.org/\">cep telefonu virus temizleme</a>- <a href=\"http://virus.temizleme.org/telefonda-virus-oldugu-nasil-anlasilir/\">telefonda virus oldugu nasil anlasilir</a>- <a href=\"http://virus.temizleme.org/cep-telefonuna-virus-nasil-bulasir/\">telefona virus nasil bulasir</a>- <a href=\"http://virus.temizleme.org/cep-telefonuma-bulasan-virusleri-nasil-temizlerim/\">telefonuma bulasan virusleri nasil temizlerim</a>- <a href=\"http://virus.temizleme.org/telefon-virus-temizleme-programi/\">telefon virus temizleme programi</a>- <a href=\"http://virus.temizleme.org/telefonu-fabrika-ayarlarina-dondurme/\">telefonu fabrika ayarlarina dondurme</a>-</div>\r\n', 'Contents Page', 90, 'no', '2017-03-14', '', 'normal', 'No', '', '', '', '', '', ''),
(871, 'Family Report', 'Generate Family Report', 'family-report', 'Header', 0, '', '', 'family-report', '', 'Link', 50, 'no', '2018-01-04', 'user.png', 'normal', 'No', '', '', '', '', '', ''),
(839, 'News / Notice', 'News / Notice', 'news-notice', 'Header', 0, '', '', '', '', 'List', 30, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(840, 'Local News 1', '', 'local-news-1', '', 839, 'Local News 11', '', 'Local News 1', '', 'ListSub', 10, 'no', '2018-01-04', '', '', 'no', '', '', '', '', '', ''),
(841, 'Local News 2', '', 'local-news-2', '', 839, 'Local News 2', '', 'Local News 2', '', 'ListSub', 20, 'no', '2018-01-04', '', '', 'no', '', '', '', '', '', ''),
(842, 'Local News 3', '', 'local-news-3', '', 839, 'Local News 3', '', 'Local News 3', '', 'ListSub', 30, 'no', '2018-01-04', '', '', 'no', '', '', '', '', '', ''),
(843, 'Local News 4', '', 'local-news-4', '', 839, 'Local News 4', '', 'Local News 4', '', 'ListSub', 40, 'no', '2018-01-04', '', '', 'no', '', '', '', '', '', ''),
(844, 'Local News 5', '', 'local-news-5', '', 839, '', '', '', '', 'ListSub', 50, 'no', '2018-01-04', '', '', 'no', '', '', '', '', '', ''),
(845, 'Local News 6', '', 'local-news-6', '', 839, '', '', '', '', 'ListSub', 60, 'no', '2018-01-04', '', '', 'no', '', '', '', '', '', ''),
(846, 'Local News 7', '', 'local-news-7', '', 839, '', '', '', '', 'ListSub', 70, 'no', '2018-01-04', '', '', 'no', '', '', '', '', '', ''),
(849, 'Test Link 1', 'Test Link 1', 'test-link-1', 'Header', 847, '', '', 'http://krishighar.com', '', 'Link', 20, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(850, 'Test Link 2', 'Test Link 2', 'test-link-2', 'Header', 847, '', '', 'http://krishighar.com', '', 'Link', 30, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(851, 'Test Link 3', 'Test Link 3', 'test-link-3', 'Header', 847, '', '', 'http://krishighar.com', '', 'Link', 40, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(852, 'Test Link 4', 'Test Link 4', 'test-link-4', 'Header', 847, '', '', 'http://krishighar.com', '', 'Link', 50, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(853, 'Test Link 5', 'Test Link 5', 'test-link-5', 'Header', 847, '', '', 'http://krishighar.com', '', 'Link', 60, 'no', '2018-01-04', '', 'normal', 'No', '', '', '', '', '', ''),
(885, '', '', '885', '', 723, '', '', '', '', 'GallerySub', 50, 'no', '2018-07-29', '885.jpg', '', '', '', '', '', '', '', ''),
(886, '', '', '886', '', 723, '', '', '', '', 'GallerySub', 50, 'no', '2018-07-29', '886.jpg', '', '', '', '', '', '', '', ''),
(887, '', '', '887', '', 723, '', '', '', '', 'GallerySub', 50, 'no', '2018-07-29', '887.jpg', '', '', '', '', '', '', '', ''),
(889, '', '', '889', '', 723, '', '', '', '', 'GallerySub', 50, 'no', '2018-07-29', '889.jpg', '', '', '', '', '', '', '', ''),
(884, 'सहयोगी हातहरु', 'सहयोगी हातहरु', 'helping-hands', 'Header', 0, 'Yog Prasad Upadhyaya Chapagain(Software Initiative)<br />\r\nGanesh Khatri(Software Enginneer)<br />\r\nHridaya Kandel(Software Engineer)<br />\r\nMohan Chapagain (Bhadrapur)(Donor)<br />\r\nPokhara Chapagain Samaj(Donor)<br />\r\nSurkhet Chapagain Bandhu(Donor)<br />\r\nGothatar Chapagain Samaj', 'Yog Prasad Upadhyaya Chapagain(Software Initiative)<br />\r\nGanesh Khatri(Software Enginneer)<br />\r\nHridaya Kandel(Software Engineer)<br />\r\nMohan Chapagain (Bhadrapur)(Donor)<br />\r\nPokhara Chapagain Samaj(Donor)<br />\r\nSurkhet Chapagain Bandhu(Donor)<br />\r\nGothatar Chapagain Samaj', 'Yog Prasad Upadhyaya Chapagain(Software Initiative)<br />\r\nGanesh Khatri(Software Enginneer)<br />\r\nHridaya Kandel(Software Engineer)<br />\r\nMohan Chapagain (Bhadrapur)(Donor)<br />\r\nPokhara Chapagain Samaj(Donor)<br />\r\nSurkhet Chapagain Bandhu(Donor)<br />\r\nGothatar Chapagain Samaj', 'Yog Prasad Upadhyaya Chapagain(Software Initiative)<br />\r\nGanesh Khatri(Software Enginneer)<br />\r\nHridaya Kandel(Software Engineer)<br />\r\nMohan Chapagain (Bhadrapur)(Donor)<br />\r\nPokhara Chapagain Samaj(Donor)<br />\r\nSurkhet Chapagain Bandhu(Donor)<br />\r\nGothatar Chapagain Samaj', 'Contents Page', 110, 'no', '2018-07-27', '', 'normal', 'No', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `listingfiles`
--

CREATE TABLE `listingfiles` (
  `id` int(11) NOT NULL,
  `caption` text NOT NULL,
  `filename` varchar(255) NOT NULL DEFAULT '',
  `listingId` int(11) NOT NULL DEFAULT '0',
  `onDate` int(11) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- Dumping data for table `listingfiles`
--

INSERT INTO `listingfiles` (`id`, `caption`, `filename`, `listingId`, `onDate`) VALUES
(12, '', 'anudan.pdf', 496, 2016),
(2, '', 'google tricks1.txt', 323, 2015),
(3, '', 'google tricks2.txt', 324, 2015),
(4, '', 'google tricks2.txt', 325, 2015),
(5, '', 'Progress  2071.72  Agri.xls', 351, 2015),
(6, '', 'Progress  2071.72  Ext.xls', 352, 2015),
(7, '', 'Progress 2070.71 Horti.xls', 353, 2015),
(8, '', 'Progress  3 rd 2071.72 Agri..xls', 354, 2015),
(9, '', 'Progress  3 rd 2071.72 Ext..xls', 355, 2015),
(10, '', 'anudan.pdf', 324, 2016),
(11, '', 'anudan.pdf', 322, 2016),
(13, '', 'Mato Biseshanka-2072.pdf', 497, 2016),
(14, '', 'Annual Report 2071-72.pdf', 520, 2016),
(15, '', '024_Digo mato vyawasthapan bibidh pakshyaharu.pdf', 522, 2016),
(16, '', 'Annual Report 2069-70.pdf', 520, 2016),
(17, '', 'Annual Report 2068-69.pdf', 520, 2016),
(18, '', 'Ekikrit khadhyatwo byawasthapan karyapustika.pdf', 522, 2016),
(19, '', 'Ekikrit khadhyatwo byawasthapan krishak pathsala.pdf', 522, 2016),
(20, '', 'Mato Parishyan pustika.pdf', 522, 2016),
(21, '', 'Kshetriya mato parichyan prayogshala.pdf', 522, 2016),
(22, '', 'National workshop on sustainable soil management programe.pdf', 522, 2016),
(25, '', 'Components of IPNS.pdf', 522, 2016),
(26, '', 'Mato jachne kit box sanchalan nirdesika.pdf', 522, 2016),
(27, '', 'Mato ko urbarasakti naksa, bibaran ra mato sudhaar ko sifaris - ek jhalak.pdf', 522, 2016),
(28, '', 'Mato tatha malkhadi byawastha sambandhi.pdf', 522, 2016),
(29, '', 'Study report on organic manure and nutrients.pdf', 522, 2016),
(30, '', 'Summary report of review and planning workshop on sustainable soil management programe.pdf', 522, 2016),
(31, '', 'Tarkari balima khadatwo kami va badiko lakshyan haru part-1.pdf', 522, 2016),
(32, '', 'Tarkari balima khadhatwo kami tatha badi lakshyanharu_Part-2.pdf', 522, 2016),
(33, '', 'Workshop on soil fertility management activities in Nepal_Searchable.pdf', 522, 2016),
(34, '', 'Workshop on soil fertility management programe and working procedure.pdf', 522, 2016),
(35, '', 'Soil Fertility  Map  of Myagdi.pdf', 523, 2016),
(36, '', 'Soil fertility Map of Arghakhachi.pdf', 523, 2016),
(37, '', 'Soil fertility map of baglung.pdf', 523, 2016),
(38, '', 'Soil Fertility Map of Banke.pdf', 523, 2016),
(39, '', 'Soil Fertility Map of Chitwan Irrigation and East Rapti.pdf', 523, 2016),
(40, '', 'Soil Fertility Map of Dadeldhura.pdf', 523, 2016),
(41, '', 'Soil fertility Map of Dailekh.pdf', 523, 2016),
(42, '', 'Soil Fertility Map of Dang.pdf', 523, 2016),
(43, '', 'Soil Fertility Map of Dolakha.pdf', 523, 2016),
(44, '', 'Soil Fertility Map of Gulmi.pdf', 523, 2016),
(45, '', 'Soil Fertility Map of Jajarkot.pdf', 523, 2016),
(46, '', 'Soil Fertility Map of Jumla.pdf', 523, 2016),
(47, '', 'Soil fertility map of Khotang.pdf', 523, 2016),
(48, '', 'Soil Fertility Map of Lamjung.pdf', 523, 2016),
(49, '', 'Soil Fertility Map of Lele.pdf', 523, 2016),
(50, '', 'Soil Fertility Map of Mahottari.pdf', 523, 2016),
(51, '', 'Soil Fertility Map of Makwanpur.pdf', 523, 2016),
(52, '', 'Soil Fertility Map of Okhaldhunga.pdf', 523, 2016),
(53, '', 'Soil Fertility Map of Palpa.pdf', 523, 2016),
(58, '', 'Soli Fertility map of Kalikot.pdf', 523, 2016),
(59, '', 'Soil Fertility Map of Syangja.pdf', 523, 2016),
(60, '', 'Soil Fertility Map of Ramechhap.pdf', 523, 2016),
(61, '', 'Soil Fertility Map of Parbat.pdf', 523, 2016),
(62, '', 'Soil Fertility Map of Parsa.pdf', 523, 2016),
(63, '', 'Soil Fertility Map of Pyuthan.pdf', 523, 2016),
(64, '', 'Soil Fertility Map of Rupandehi.pdf', 523, 2016),
(65, '', 'Soil Fertility Map of Sindhuli.pdf', 523, 2016),
(66, '', 'Soil Fertility Map of Surkhet.pdf', 523, 2016),
(67, '', 'Soil Fertility Map of Terathum.pdf', 523, 2016),
(68, '', 'Bhakaro Sudhar Karyabidhi.pdf', 524, 2016),
(69, '', 'Bio-fertilizer.pdf', 524, 2016),
(70, '', 'Green manures.pdf', 524, 2016),
(71, '', 'Brochure Bhakaro.pdf', 524, 2016),
(72, '', 'Sampling.pdf', 524, 2016),
(73, '', 'Soil Management Norms.pdf', 524, 2016),
(74, '', 'Vermi-composting.pdf', 524, 2016),
(75, '', 'Brief Introduction.pdf', 525, 2016),
(76, '', 'mal.pdf', 527, 2016),
(92, '', 'OM Registration Sheet 2073.xlsx', 528, 2016),
(79, 'Karyabidhi organic fertilizer regulation', 'Karyabidhi organic fertilizer regulation.pdf', 532, 2016),
(80, '', 'O.F regulation Karyabidhi District levrl.pdf', 533, 2016),
(81, '', 'organic fertilizer subsidy guideline 2068.pdf', 534, 2016),
(82, '', 'Rhizobium tender notice.pdf', 535, 2016),
(84, '', 'kulprasad(world egg day) 4.pdf', 541, 2016),
(86, '', 'Lab equipments and glassware tender notice 2073.pdf', 542, 2016),
(93, '', 'test.pdf', 575, 2147483647),
(94, '', 'test.pdf', 575, 2147483647),
(95, '', '2c9e58c9-86d5-46ee-9380-12f44fadd29a.pdf', 711, 2017),
(96, '', 'NationalPortal_revamp_EOI_Advertisement.pdf', 711, 2017),
(97, '', 'Who is who1.pdf', 711, 2017),
(98, '', '2c9e58c9-86d5-46ee-9380-12f44fadd29a.pdf', 712, 2017),
(99, '', '2c9e58c9-86d5-46ee-9380-12f44fadd29a.pdf', 712, 2017),
(100, '', '2c9e58c9-86d5-46ee-9380-12f44fadd29a.pdf', 712, 2017),
(101, 'air pol', '2c9e58c9-86d5-46ee-9380-12f44fadd29a.pdf', 716, 2017),
(102, 'air book', 'Who is who1.pdf', 716, 2017),
(103, 'THE SUPPLY, INSTALLATION, TRAINING AND DEMONSTRATION OPERATION OF LABORATORY INSTRUMENTS', 'LAB Equipment Tender.pdf', 745, 2147483647),
(104, '?????????? ??????? ??? ????????? ?????????? ???????', 'Collection of Environmental Standards.pdf', 749, 2147483647),
(105, '', 'Collection of Environmental Standards.pdf', 751, 2147483647),
(106, 'Collection of Environmental Standards', 'Collection of Environmental Standards.pdf', 755, 2147483647),
(107, 'Staff Name List of DoEnv', 'Name List of Staff of DoEnv.pdf', 760, 2147483647),
(108, '??????? ????????, ????', 'Final_Setting_PDF_FORMAT_2071.04.05_3.40PM.pdf', 766, 2147483647),
(109, 'Journal of Environment Sciences Vol-1', 'Journal_of_Environment_Sciences_Vol_1.pdf', 767, 2147483647),
(111, 'Journal of Environment Sciences Vol-2', 'Environment book inner page 2016.pdf', 780, 2147483647),
(112, '??????? ??????? ??????', 'Broucher ban.indd.pdf', 794, 2147483647),
(113, '?.?.????/?? ?? ??????? ????????? ???????', 'Suchi darta List of 2073_74.pdf', 795, 2147483647),
(115, '????? ??????? ???? ???? ?? ?????????? ??????? ??????? ????????????? ??????', 'World Environment Day 2017.jpg', 815, 2147483647),
(116, '', 'VB Script Consultant .pdf', 822, 2147483647),
(117, '', 'Climate Smart Village Actions Plan.pdf', 821, 2147483647),
(122, '', 'Bio-fertilizer.pdf', 840, 2147483647),
(123, '', 'Green manures.pdf', 840, 2147483647);

-- --------------------------------------------------------

--
-- Table structure for table `region`
--

CREATE TABLE `region` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `onDate` date NOT NULL,
  `publish` varchar(3) NOT NULL,
  `weight` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `region`
--

INSERT INTO `region` (`id`, `name`, `onDate`, `publish`, `weight`) VALUES
(6, 'test region 2', '2017-12-26', 'Yes', 20),
(7, 'Test region 3', '2017-12-26', 'Yes', 30);

-- --------------------------------------------------------

--
-- Table structure for table `rel_father`
--

CREATE TABLE `rel_father` (
  `memberId` int(30) NOT NULL,
  `fatherId` int(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `rel_father`
--

INSERT INTO `rel_father` (`memberId`, `fatherId`) VALUES
(13, 8),
(14, 8),
(15, 13);

-- --------------------------------------------------------

--
-- Table structure for table `rel_mother`
--

CREATE TABLE `rel_mother` (
  `memberId` int(30) NOT NULL,
  `motherId` int(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `rel_mother`
--

INSERT INTO `rel_mother` (`memberId`, `motherId`) VALUES
(13, 9),
(14, 9),
(15, 14);

-- --------------------------------------------------------

--
-- Table structure for table `testimonials`
--

CREATE TABLE `testimonials` (
  `id` int(10) NOT NULL,
  `image` varchar(250) NOT NULL DEFAULT '',
  `name` varchar(250) NOT NULL DEFAULT '',
  `address` varchar(250) NOT NULL,
  `comments` text NOT NULL,
  `status` int(1) NOT NULL DEFAULT '0',
  `onDate` date NOT NULL DEFAULT '0000-00-00'
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `usergroups`
--

CREATE TABLE `usergroups` (
  `id` int(11) NOT NULL,
  `name` varchar(200) NOT NULL,
  `username` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `address` varchar(200) NOT NULL,
  `phone` int(20) NOT NULL,
  `publish` varchar(3) NOT NULL,
  `weight` int(10) NOT NULL,
  `onDate` date NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- Dumping data for table `usergroups`
--

INSERT INTO `usergroups` (`id`, `name`, `username`, `password`, `email`, `address`, `phone`, `publish`, `weight`, `onDate`) VALUES
(59, 'Ganesh', '5ganes', '5ganes', 'kh6ganesh@gmail.com', 'Putalidadak, Kathmandu', 2147483647, 'Yes', 10, '2017-06-08'),
(60, 'Anish', 'anish', 'shrestha', 'anish.shrestha.1989@gmail.com', 'Kathmandu', 2147483647, 'Yes', 20, '2017-06-08'),
(61, 'Bhishma Raj Subedi', 'indragufa@gmail.com', 'sbhishma', 'Bhumekot123@gmail.com', 'Kaski, Hansapur', 2147483647, 'No', 30, '2017-06-09');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `lastLogin` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `loginTimes` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `status` enum('A','D') NOT NULL DEFAULT 'D',
  `userGroupId` int(10) UNSIGNED NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `lastLogin`, `loginTimes`, `status`, `userGroupId`) VALUES
(1, 'admin', 'chapagain_123_#', '2018-09-06 16:30:34', 502, 'A', 1),
(2, 'manager', 'manager', '2017-01-12 21:32:00', 36, 'A', 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `district`
--
ALTER TABLE `district`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `family`
--
ALTER TABLE `family`
  ADD PRIMARY KEY (`id`),
  ADD KEY `gotraId` (`gotraId`),
  ADD KEY `regionId` (`regionId`);

--
-- Indexes for table `feedbacks`
--
ALTER TABLE `feedbacks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `gotra`
--
ALTER TABLE `gotra`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id` (`id`);

--
-- Indexes for table `groups`
--
ALTER TABLE `groups`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `urlname` (`urlname`);

--
-- Indexes for table `listingfiles`
--
ALTER TABLE `listingfiles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `region`
--
ALTER TABLE `region`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id` (`id`);

--
-- Indexes for table `rel_father`
--
ALTER TABLE `rel_father`
  ADD PRIMARY KEY (`memberId`),
  ADD KEY `fatherId` (`fatherId`),
  ADD KEY `memberId` (`memberId`);

--
-- Indexes for table `rel_mother`
--
ALTER TABLE `rel_mother`
  ADD PRIMARY KEY (`memberId`),
  ADD KEY `motherId` (`motherId`),
  ADD KEY `memberId` (`memberId`);

--
-- Indexes for table `testimonials`
--
ALTER TABLE `testimonials`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `usergroups`
--
ALTER TABLE `usergroups`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `district`
--
ALTER TABLE `district`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;

--
-- AUTO_INCREMENT for table `family`
--
ALTER TABLE `family`
  MODIFY `id` int(30) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `feedbacks`
--
ALTER TABLE `feedbacks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `gotra`
--
ALTER TABLE `gotra`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `groups`
--
ALTER TABLE `groups`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=899;

--
-- AUTO_INCREMENT for table `listingfiles`
--
ALTER TABLE `listingfiles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=124;

--
-- AUTO_INCREMENT for table `region`
--
ALTER TABLE `region`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `testimonials`
--
ALTER TABLE `testimonials`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `usergroups`
--
ALTER TABLE `usergroups`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `family`
--
ALTER TABLE `family`
  ADD CONSTRAINT `gotraFamilyId` FOREIGN KEY (`gotraId`) REFERENCES `gotra` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `regionFamilyId` FOREIGN KEY (`regionId`) REFERENCES `region` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `rel_father`
--
ALTER TABLE `rel_father`
  ADD CONSTRAINT `rel_father_fatherId` FOREIGN KEY (`fatherId`) REFERENCES `family` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `rel_father_memberId` FOREIGN KEY (`memberId`) REFERENCES `family` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `rel_mother`
--
ALTER TABLE `rel_mother`
  ADD CONSTRAINT `rel_mother_memberId` FOREIGN KEY (`memberId`) REFERENCES `family` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `rel_mother_motherId` FOREIGN KEY (`motherId`) REFERENCES `family` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
